Loaded default logging configuration.
[2026-05-02 14:01:47] [INFO] Parameters passed in 
-------------------- 
[2026-05-02 14:01:47] [INFO] srcDir = C:\work\aws-mainframe-modernization-carddemo\app\cbl 
[2026-05-02 14:01:47] [INFO] reportRootDir = C:\work\aws-mainframe-modernization-carddemo\validation\rekt\COCRDLIC.cbl.report 
[2026-05-02 14:01:47] [INFO] dialectJarPath = C:\work\cobol-rekt\che-che4z-lsp-for-cobol-integration\server\dialect-idms\target\dialect-idms.jar 
[2026-05-02 14:01:47] [INFO] copyBookPaths = C:\work\aws-mainframe-modernization-carddemo\app\cpy
,C:\work\aws-mainframe-modernization-carddemo\app\cpy-bms
,C:\work\aws-mainframe-modernization-carddemo\app\cpy-stubs
 
[2026-05-02 14:01:47] [INFO] C:\work\aws-mainframe-modernization-carddemo\app\cpy 
[2026-05-02 14:01:47] [INFO] C:\work\aws-mainframe-modernization-carddemo\app\cpy-bms 
[2026-05-02 14:01:47] [INFO] C:\work\aws-mainframe-modernization-carddemo\app\cpy-stubs 
[2026-05-02 14:01:47] [INFO] Running tasks: [WRITE_FLOW_AST, WRITE_CFG, WRITE_DATA_STRUCTURES] for program 'COCRDLIC.cbl' in PRODUCTION mode... 
[2026-05-02 14:01:47] [INFO] Searching for program: COCRDLIC.cbl... 
[2026-05-02 14:01:47] [INFO] Listing files recursively in directory: 'C:\work\aws-mainframe-modernization-carddemo\app\cbl' 
[2026-05-02 14:01:47] [INFO] Found COCRDLIC.cbl in C:\work\aws-mainframe-modernization-carddemo\app\cbl 
WARNING: A terminally deprecated method in sun.misc.Unsafe has been called
WARNING: sun.misc.Unsafe::objectFieldOffset has been called by com.google.common.util.concurrent.AbstractFuture$UnsafeAtomicHelper (file:/C:/work/cobol-rekt/smojol-cli/target/smojol-cli.jar)
WARNING: Please consider reporting this to the maintainers of class com.google.common.util.concurrent.AbstractFuture$UnsafeAtomicHelper
WARNING: sun.misc.Unsafe::objectFieldOffset will be removed in a future release
[2026-05-02 14:01:47] [FINE] Module execution: 70ms 
[2026-05-02 14:01:47] [FINE] TypeListeners & ProvisionListener creation: 2ms 
[2026-05-02 14:01:47] [FINE] Scopes creation: 2ms 
[2026-05-02 14:01:47] [FINE] Converters creation: 1ms 
[2026-05-02 14:01:47] [FINE] Binding creation: 8ms 
[2026-05-02 14:01:47] [FINE] Module annotated method scanners creation: 0ms 
[2026-05-02 14:01:47] [FINE] Private environment creation: 1ms 
[2026-05-02 14:01:47] [FINE] Injector construction: 0ms 
[2026-05-02 14:01:47] [FINE] Binding initialization: 3ms 
[2026-05-02 14:01:47] [FINE] Binding indexing: 1ms 
[2026-05-02 14:01:47] [FINE] Collecting injection requests: 0ms 
[2026-05-02 14:01:47] [FINE] Binding validation: 27ms 
[2026-05-02 14:01:47] [FINE] Static validation: 0ms 
[2026-05-02 14:01:47] [FINE] Instance member validation: 1ms 
[2026-05-02 14:01:47] [FINE] Provider verification: 0ms 
[2026-05-02 14:01:47] [FINE] Delayed Binding initialization: 3ms 
[2026-05-02 14:01:47] [FINE] Static member injection: 0ms 
[2026-05-02 14:01:47] [FINE] Module execution: 1ms 
[2026-05-02 14:01:47] [FINE] TypeListeners & ProvisionListener creation: 1ms 
[2026-05-02 14:01:47] [FINE] Scopes creation: 0ms 
[2026-05-02 14:01:47] [FINE] Converters creation: 0ms 
[2026-05-02 14:01:47] [FINE] Binding creation: 3ms 
[2026-05-02 14:01:47] [FINE] Module annotated method scanners creation: 0ms 
[2026-05-02 14:01:47] [FINE] Private environment creation: 0ms 
[2026-05-02 14:01:47] [FINE] Injector construction: 0ms 
[2026-05-02 14:01:47] [FINE] Binding initialization: 1ms 
[2026-05-02 14:01:47] [FINE] Binding indexing: 0ms 
[2026-05-02 14:01:47] [FINE] Collecting injection requests: 0ms 
[2026-05-02 14:01:47] [FINE] Binding validation: 0ms 
[2026-05-02 14:01:47] [FINE] Static validation: 0ms 
[2026-05-02 14:01:47] [FINE] Instance member validation: 0ms 
[2026-05-02 14:01:47] [FINE] Provider verification: 1ms 
[2026-05-02 14:01:47] [FINE] Delayed Binding initialization: 0ms 
[2026-05-02 14:01:47] [FINE] Static member injection: 0ms 
[2026-05-02 14:01:47] [FINE] Instance injection: 0ms 
[2026-05-02 14:01:47] [FINE] Preloading singletons: 0ms 
[2026-05-02 14:01:47] [FINE] Module execution: 1ms 
[2026-05-02 14:01:47] [FINE] TypeListeners & ProvisionListener creation: 0ms 
[2026-05-02 14:01:47] [FINE] Scopes creation: 0ms 
[2026-05-02 14:01:47] [FINE] Converters creation: 0ms 
[2026-05-02 14:01:47] [FINE] Binding creation: 1ms 
[2026-05-02 14:01:47] [FINE] Module annotated method scanners creation: 0ms 
[2026-05-02 14:01:47] [FINE] Private environment creation: 0ms 
[2026-05-02 14:01:47] [FINE] Injector construction: 0ms 
[2026-05-02 14:01:47] [FINE] Binding initialization: 1ms 
[2026-05-02 14:01:47] [FINE] Binding indexing: 0ms 
[2026-05-02 14:01:47] [FINE] Collecting injection requests: 0ms 
[2026-05-02 14:01:47] [FINE] Binding validation: 0ms 
[2026-05-02 14:01:47] [FINE] Static validation: 0ms 
[2026-05-02 14:01:47] [FINE] Instance member validation: 0ms 
[2026-05-02 14:01:47] [FINE] Provider verification: 0ms 
[2026-05-02 14:01:47] [FINE] Delayed Binding initialization: 1ms 
[2026-05-02 14:01:47] [FINE] Static member injection: 0ms 
[2026-05-02 14:01:47] [FINE] Instance injection: 0ms 
[2026-05-02 14:01:47] [FINE] Preloading singletons: 0ms 
[2026-05-02 14:01:47] [FINE] Instance injection: 17ms 
[2026-05-02 14:01:47] [FINE] Preloading singletons: 1ms 
[2026-05-02 14:01:47] [INFO] Reading bytes from path: 'C:\work\aws-mainframe-modernization-carddemo\app\cbl\COCRDLIC.cbl' 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [1] : EXEC CICS XCTL
                        PROGRAM (LIT-MENUPGM)
                        COMMAREA(CARDDEMO-COMMAREA)
              END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [2] : EXEC CICS XCTL
                        PROGRAM (CCARD-NEXT-PROG)
                        COMMAREA(CARDDEMO-COMMAREA)
                   END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [3] : EXEC CICS XCTL
                        PROGRAM (CCARD-NEXT-PROG)
                        COMMAREA(CARDDEMO-COMMAREA)
                   END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [4] : EXEC CICS RETURN
                TRANSID (LIT-THISTRANID)
                COMMAREA (WS-COMMAREA)
                LENGTH(LENGTH OF WS-COMMAREA)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [5] : EXEC CICS SEND MAP(LIT-THISMAP)
                          MAPSET(LIT-THISMAPSET)
                          FROM(CCRDLIAO)
                          CURSOR
                          ERASE
                          RESP(WS-RESP-CD)
                          FREEKB
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [6] : EXEC CICS RECEIVE MAP(LIT-THISMAP)
                          MAPSET(LIT-THISMAPSET)
                          INTO(CCRDLIAI)
                          RESP(WS-RESP-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [7] : EXEC CICS STARTBR
                DATASET(LIT-CARD-FILE)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                GTEQ
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [8] : EXEC CICS READNEXT
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [9] : DFHRESP(NORMAL)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [10] : DFHRESP(DUPREC)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [11] : EXEC CICS READNEXT
                        DATASET(LIT-CARD-FILE)
                        INTO (CARD-RECORD)
                        LENGTH(LENGTH OF CARD-RECORD)
                        RIDFLD(WS-CARD-RID-CARDNUM)
                        KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                        RESP(WS-RESP-CD)
                        RESP2(WS-REAS-CD)
                      END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [12] : DFHRESP(NORMAL)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [13] : DFHRESP(DUPREC)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [14] : DFHRESP(ENDFILE)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [15] : DFHRESP(ENDFILE)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [16] : EXEC CICS ENDBR FILE(LIT-CARD-FILE)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [17] : EXEC CICS STARTBR
                DATASET(LIT-CARD-FILE)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                GTEQ
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [18] : EXEC CICS READPREV
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [19] : DFHRESP(NORMAL)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [20] : DFHRESP(DUPREC)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [21] : EXEC CICS READPREV
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [22] : DFHRESP(NORMAL)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [23] : DFHRESP(DUPREC)
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [24] : EXEC CICS
                ENDBR FILE(LIT-CARD-FILE)
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [25] : EXEC CICS SEND TEXT
                     FROM(WS-ERROR-MSG)
                     LENGTH(LENGTH OF WS-ERROR-MSG)
                     ERASE
                     FREEKB
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [26] : EXEC CICS RETURN
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [27] : EXEC CICS SEND TEXT
                     FROM(WS-LONG-MSG)
                     LENGTH(LENGTH OF WS-LONG-MSG)
                     ERASE
                     FREEKB
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Replaced dialect text number [28] : EXEC CICS RETURN
           END-EXEC
 
[2026-05-02 14:01:48] [INFO] Inlined listing is: 
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           COCRDLIC.
       DATE-WRITTEN.
           April 2022.
       DATE-COMPILED.
           Today.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       
       
       01  WS-MISC-STORAGE.
       
       
       
       
         05 WS-CICS-PROCESSNG-VARS.
            07 WS-RESP-CD                          PIC S9(09) COMP
                                                   VALUE ZEROS.
            07 WS-REAS-CD                          PIC S9(09) COMP
                                                   VALUE ZEROS.
            07 WS-TRANID                           PIC X(4)
                                                   VALUE SPACES.
       
       
       
         05 WS-INPUT-FLAG                          PIC X(1).
           88  INPUT-OK                            VALUES '0'
                                                          ' '
                                                   LOW-VALUES.
           88  INPUT-ERROR                         VALUE '1'.
         05  WS-EDIT-ACCT-FLAG                     PIC X(1).
           88  FLG-ACCTFILTER-NOT-OK               VALUE '0'.
           88  FLG-ACCTFILTER-ISVALID             VALUE '1'.
           88  FLG-ACCTFILTER-BLANK                VALUE ' '.
         05  WS-EDIT-CARD-FLAG                     PIC X(1).
           88  FLG-CARDFILTER-NOT-OK               VALUE '0'.
           88  FLG-CARDFILTER-ISVALID             VALUE '1'.
           88  FLG-CARDFILTER-BLANK                VALUE ' '.
         05 WS-EDIT-SELECT-COUNTER                PIC S9(04)
                                                  USAGE COMP-3
                                                  VALUE 0.
         05 WS-EDIT-SELECT-FLAGS                  PIC X(7)
                                                  VALUE LOW-VALUES.
         05 WS-EDIT-SELECT-ARRAY REDEFINES  WS-EDIT-SELECT-FLAGS.
            10 WS-EDIT-SELECT                      PIC X(1)
                                                  OCCURS 7 TIMES.
               88 SELECT-OK                        VALUES 'S', 'U'.
               88 VIEW-REQUESTED-ON                VALUE 'S'.
               88 UPDATE-REQUESTED-ON              VALUE 'U'.
               88 SELECT-BLANK                     VALUES
                                                   ' ', 
                                                   LOW-VALUES.
         05 WS-EDIT-SELECT-ERROR-FLAGS             PIC X(7).
         05 WS-EDIT-SELECT-ERROR-FLAGX     REDEFINES
            WS-EDIT-SELECT-ERROR-FLAGS.
            10 WS-EDIT-SELECT-ERRORS OCCURS 7 TIMES.
               20 WS-ROW-CRDSELECT-ERROR          PIC X(1).
                  88 WS-ROW-SELECT-ERROR          VALUE '1'.
         05 WS-SUBSCRIPT-VARS.
            10 I                                  PIC S9(4) COMP
                                                  VALUE 0.
            10 I-SELECTED                         PIC S9(4) COMP
                                                  VALUE 0.
               88 DETAIL-WAS-REQUESTED            VALUES 1 THRU 7.
       
       
       
         05 CICS-OUTPUT-EDIT-VARS.
           10  CARD-ACCT-ID-X                      PIC X(11).
           10  CARD-ACCT-ID-N REDEFINES CARD-ACCT-ID-X
                                                   PIC 9(11).
           10  CARD-CVV-CD-X                       PIC X(03).
           10  CARD-CVV-CD-N REDEFINES  CARD-CVV-CD-X
                                                   PIC 9(03).
           10  FLG-PROTECT-SELECT-ROWS             PIC X(1).
           88  FLG-PROTECT-SELECT-ROWS-NO          VALUE '0'.
           88  FLG-PROTECT-SELECT-ROWS-YES         VALUE '1'.
       
       
       
         05  WS-LONG-MSG                           PIC X(500).
         05  WS-INFO-MSG                           PIC X(45).
           88  WS-NO-INFO-MESSAGE                 VALUES
                                                  SPACES LOW-VALUES.
           88  WS-INFORM-REC-ACTIONS          VALUE
               'TYPE S FOR DETAIL, U TO UPDATE ANY RECORD'.
         05  WS-ERROR-MSG                         PIC X(75).
           88  WS-ERROR-MSG-OFF                   VALUE SPACES.
           88  WS-EXIT-MESSAGE                     VALUE
               'PF03 PRESSED.EXITING'.
           88  WS-NO-RECORDS-FOUND                 VALUE
               'NO RECORDS FOUND FOR THIS SEARCH CONDITION.'.
           88  WS-MORE-THAN-1-ACTION              VALUE
               'PLEASE SELECT ONLY ONE RECORD TO VIEW OR UPDATE'.
           88  WS-INVALID-ACTION-CODE              VALUE
               'INVALID ACTION CODE'.
         05  WS-PFK-FLAG                           PIC X(1).
           88  PFK-VALID                           VALUE '0'.
           88  PFK-INVALID                         VALUE '1'.
         05  WS-CONTEXT-FLAG                       PIC X(1).
           88  WS-CONTEXT-FRESH-START              VALUE '0'.
           88  WS-CONTEXT-FRESH-START-NO           VALUE '1'.
       
       
       
         05 WS-FILE-HANDLING-VARS.
            10  WS-CARD-RID.
                20  WS-CARD-RID-CARDNUM            PIC X(16).
                20  WS-CARD-RID-ACCT-ID            PIC 9(11).
                20  WS-CARD-RID-ACCT-ID-X          REDEFINES
                    WS-CARD-RID-ACCT-ID            PIC X(11).
       
       
       
         05  WS-SCRN-COUNTER               PIC S9(4) COMP VALUE 0.
       
         05  WS-FILTER-RECORD-FLAG                 PIC X(1).
           88  WS-EXCLUDE-THIS-RECORD               VALUE '0'.
           88  WS-DONOT-EXCLUDE-THIS-RECORD         VALUE '1'.
         05  WS-RECORDS-TO-PROCESS-FLAG            PIC X(1).
           88  READ-LOOP-EXIT                      VALUE '0'.
           88  MORE-RECORDS-TO-READ                VALUE '1'.
         05  WS-FILE-ERROR-MESSAGE.
           10  FILLER                              PIC X(12)
                                                   VALUE 'File Error:'.
           10  ERROR-OPNAME                        PIC X(8)
                                                   VALUE SPACES.
           10  FILLER                              PIC X(4)
                                                   VALUE ' on '.
           10  ERROR-FILE                          PIC X(9)
                                                   VALUE SPACES.
           10  FILLER                              PIC X(15)
                                                   VALUE
                                                   ' returned RESP '.
           10  ERROR-RESP                          PIC X(10)
                                                   VALUE SPACES.
           10  FILLER                              PIC X(7)
                                                   VALUE ',RESP2 '.
           10  ERROR-RESP2                         PIC X(10)
                                                   VALUE SPACES.
          10  FILLER                               PIC X(5).
       
       
       
       
       01 WS-CONSTANTS.
         05  WS-MAX-SCREEN-LINES                    PIC S9(4) COMP
                                                    VALUE 7.
         05  LIT-THISPGM                            PIC X(8)
             VALUE 'COCRDLIC'.
         05  LIT-THISTRANID                         PIC X(4)
             VALUE 'CCLI'.
         05  LIT-THISMAPSET                         PIC X(7)
             VALUE 'COCRDLI'.
         05  LIT-THISMAP                            PIC X(7)
             VALUE 'CCRDLIA'.
         05  LIT-MENUPGM                            PIC X(8)
             VALUE 'COMEN01C'.
         05  LIT-MENUTRANID                         PIC X(4)
             VALUE 'CM00'.
         05  LIT-MENUMAPSET                         PIC X(7)
             VALUE 'COMEN01'.
         05  LIT-MENUMAP                            PIC X(7)
             VALUE 'COMEN1A'.
         05  LIT-CARDDTLPGM                         PIC X(8)
             VALUE 'COCRDSLC'.
         05  LIT-CARDDTLTRANID                      PIC X(4)
             VALUE 'CCDL'.
         05  LIT-CARDDTLMAPSET                      PIC X(7)
             VALUE 'COCRDSL'.
         05  LIT-CARDDTLMAP                         PIC X(7)
             VALUE 'CCRDSLA'.
         05  LIT-CARDUPDPGM                         PIC X(8)
             VALUE 'COCRDUPC'.
         05  LIT-CARDUPDTRANID                      PIC X(4)
             VALUE 'CCUP'.
         05  LIT-CARDUPDMAPSET                      PIC X(7)
             VALUE 'COCRDUP'.
         05  LIT-CARDUPDMAP                         PIC X(7)
             VALUE 'CCRDUPA'.
       
       
         05  LIT-CARD-FILE                          PIC X(8)
                                                   VALUE 'CARDDAT '.
         05  LIT-CARD-FILE-ACCT-PATH                PIC X(8)
       
                                                   VALUE 'CARDAIX '.
       
       
       
       
       01  CC-WORK-AREAS.
          05 CC-WORK-AREA.
             10 CCARD-AID                         PIC X(5).
                88  CCARD-AID-ENTER                VALUE 'ENTER'.
                88  CCARD-AID-CLEAR                VALUE 'CLEAR'.
                88  CCARD-AID-PA1                  VALUE 'PA1  '.
                88  CCARD-AID-PA2                  VALUE 'PA2  '.
                88  CCARD-AID-PFK01                VALUE 'PFK01'.
                88  CCARD-AID-PFK02                VALUE 'PFK02'.
                88  CCARD-AID-PFK03                VALUE 'PFK03'.
                88  CCARD-AID-PFK04                VALUE 'PFK04'.
                88  CCARD-AID-PFK05                VALUE 'PFK05'.
                88  CCARD-AID-PFK06                VALUE 'PFK06'.
                88  CCARD-AID-PFK07                VALUE 'PFK07'.
                88  CCARD-AID-PFK08                VALUE 'PFK08'.
                88  CCARD-AID-PFK09                VALUE 'PFK09'.
                88  CCARD-AID-PFK10                VALUE 'PFK10'.
                88  CCARD-AID-PFK11                VALUE 'PFK11'.
                88  CCARD-AID-PFK12                VALUE 'PFK12'.
       
             10  CCARD-NEXT-PROG                  PIC X(8).
       
             10  CCARD-NEXT-MAPSET                PIC X(7).
             10  CCARD-NEXT-MAP                   PIC X(7).
       
       
       
             10  CCARD-ERROR-MSG                  PIC X(75).
             10  CCARD-RETURN-MSG                 PIC X(75).
               88  CCARD-RETURN-MSG-OFF           VALUE LOW-VALUES.
       
       
       
             10 CC-ACCT-ID                        PIC X(11)
                                                  VALUE SPACES.
             10 CC-ACCT-ID-N REDEFINES CC-ACCT-ID PIC 9(11).
             10 CC-CARD-NUM                       PIC X(16)
                                                  VALUE SPACES.
             10 CC-CARD-NUM-N REDEFINES CC-CARD-NUM PIC 9(16).
             10 CC-CUST-ID                        PIC X(09)
                                                  VALUE SPACES.
             10 CC-CUST-ID-N REDEFINES CC-CUST-ID PIC 9(9).
              
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01 CARDDEMO-COMMAREA.
          05 CDEMO-GENERAL-INFO.
             10 CDEMO-FROM-TRANID             PIC X(04).
             10 CDEMO-FROM-PROGRAM            PIC X(08).
             10 CDEMO-TO-TRANID               PIC X(04).
             10 CDEMO-TO-PROGRAM              PIC X(08).
             10 CDEMO-USER-ID                 PIC X(08).
             10 CDEMO-USER-TYPE               PIC X(01).
                88 CDEMO-USRTYP-ADMIN         VALUE 'A'.
                88 CDEMO-USRTYP-USER          VALUE 'U'.
             10 CDEMO-PGM-CONTEXT             PIC 9(01).
                88 CDEMO-PGM-ENTER            VALUE 0.
                88 CDEMO-PGM-REENTER          VALUE 1.
          05 CDEMO-CUSTOMER-INFO.
             10 CDEMO-CUST-ID                 PIC 9(09).
             10 CDEMO-CUST-FNAME              PIC X(25).
             10 CDEMO-CUST-MNAME              PIC X(25).
             10 CDEMO-CUST-LNAME              PIC X(25).
          05 CDEMO-ACCOUNT-INFO.
             10 CDEMO-ACCT-ID                 PIC 9(11).
             10 CDEMO-ACCT-STATUS             PIC X(01).
          05 CDEMO-CARD-INFO.
             10 CDEMO-CARD-NUM                PIC 9(16).
          05 CDEMO-MORE-INFO.
             10  CDEMO-LAST-MAP               PIC X(7).
             10  CDEMO-LAST-MAPSET            PIC X(7).
              
       
       01 WS-THIS-PROGCOMMAREA.
            10 WS-CA-LAST-CARDKEY.
               15  WS-CA-LAST-CARD-NUM                PIC X(16).
               15  WS-CA-LAST-CARD-ACCT-ID            PIC 9(11).
            10 WS-CA-FIRST-CARDKEY.
               15  WS-CA-FIRST-CARD-NUM               PIC X(16).
               15  WS-CA-FIRST-CARD-ACCT-ID           PIC 9(11).
       
            10 WS-CA-SCREEN-NUM                       PIC 9(1).
               88 CA-FIRST-PAGE                          VALUE 1.
            10 WS-CA-LAST-PAGE-DISPLAYED              PIC 9(1).
               88 CA-LAST-PAGE-SHOWN                     VALUE 0.
               88 CA-LAST-PAGE-NOT-SHOWN                 VALUE 9.
            10 WS-CA-NEXT-PAGE-IND                    PIC X(1).
               88 CA-NEXT-PAGE-NOT-EXISTS             VALUE LOW-VALUES.
               88 CA-NEXT-PAGE-EXISTS                 VALUE 'Y'.
       
            10 WS-RETURN-FLAG                        PIC X(1).
           88  WS-RETURN-FLAG-OFF                  VALUE LOW-VALUES.
           88  WS-RETURN-FLAG-ON                   VALUE '1'.
       
       
       
         05 WS-SCREEN-DATA.
            10 WS-ALL-ROWS                         PIC X(196).
            10 FILLER REDEFINES WS-ALL-ROWS.
               15 WS-SCREEN-ROWS OCCURS  7 TIMES.
                  20 WS-EACH-ROW.
                     25 WS-EACH-CARD.
                        30 WS-ROW-ACCTNO           PIC X(11).
                        30 WS-ROW-CARD-NUM         PIC X(16).
                        30 WS-ROW-CARD-STATUS      PIC X(1).
       
       01  WS-COMMAREA                             PIC X(2000).
       
       
       
       
       

              
       

            
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01 CCDA-SCREEN-TITLE.
         05 CCDA-TITLE01    PIC X(40) VALUE
            '      AWS Mainframe Modernization       '.
         05 CCDA-TITLE02    PIC X(40) VALUE
       
            '              CardDemo                  '.
         05 CCDA-THANK-YOU  PIC X(40) VALUE
            'Thank you for using CCDA application... '.
              
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01  CCRDLIAI.
           02  FILLER PIC X(12).
           02  TRNNAMEL    COMP  PIC  S9(4).
           02  TRNNAMEF    PICTURE X.
           02  FILLER REDEFINES TRNNAMEF.
             03 TRNNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNNAMEI  PIC X(4).
           02  TITLE01L    COMP  PIC  S9(4).
           02  TITLE01F    PICTURE X.
           02  FILLER REDEFINES TITLE01F.
             03 TITLE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE01I  PIC X(40).
           02  CURDATEL    COMP  PIC  S9(4).
           02  CURDATEF    PICTURE X.
           02  FILLER REDEFINES CURDATEF.
             03 CURDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURDATEI  PIC X(8).
           02  PGMNAMEL    COMP  PIC  S9(4).
           02  PGMNAMEF    PICTURE X.
           02  FILLER REDEFINES PGMNAMEF.
             03 PGMNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PGMNAMEI  PIC X(8).
           02  TITLE02L    COMP  PIC  S9(4).
           02  TITLE02F    PICTURE X.
           02  FILLER REDEFINES TITLE02F.
             03 TITLE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE02I  PIC X(40).
           02  CURTIMEL    COMP  PIC  S9(4).
           02  CURTIMEF    PICTURE X.
           02  FILLER REDEFINES CURTIMEF.
             03 CURTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURTIMEI  PIC X(8).
           02  PAGENOL    COMP  PIC  S9(4).
           02  PAGENOF    PICTURE X.
           02  FILLER REDEFINES PAGENOF.
             03 PAGENOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PAGENOI  PIC X(3).
           02  ACCTSIDL    COMP  PIC  S9(4).
           02  ACCTSIDF    PICTURE X.
           02  FILLER REDEFINES ACCTSIDF.
             03 ACCTSIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTSIDI  PIC X(11).
           02  CARDSIDL    COMP  PIC  S9(4).
           02  CARDSIDF    PICTURE X.
           02  FILLER REDEFINES CARDSIDF.
             03 CARDSIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CARDSIDI  PIC X(16).
           02  CRDSEL1L    COMP  PIC  S9(4).
           02  CRDSEL1F    PICTURE X.
           02  FILLER REDEFINES CRDSEL1F.
             03 CRDSEL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL1I  PIC X(1).
           02  ACCTNO1L    COMP  PIC  S9(4).
           02  ACCTNO1F    PICTURE X.
           02  FILLER REDEFINES ACCTNO1F.
             03 ACCTNO1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO1I  PIC X(11).
           02  CRDNUM1L    COMP  PIC  S9(4).
           02  CRDNUM1F    PICTURE X.
           02  FILLER REDEFINES CRDNUM1F.
             03 CRDNUM1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM1I  PIC X(16).
           02  CRDSTS1L    COMP  PIC  S9(4).
           02  CRDSTS1F    PICTURE X.
           02  FILLER REDEFINES CRDSTS1F.
             03 CRDSTS1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS1I  PIC X(1).
           02  CRDSEL2L    COMP  PIC  S9(4).
           02  CRDSEL2F    PICTURE X.
           02  FILLER REDEFINES CRDSEL2F.
             03 CRDSEL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL2I  PIC X(1).
           02  CRDSTP2L    COMP  PIC  S9(4).
           02  CRDSTP2F    PICTURE X.
           02  FILLER REDEFINES CRDSTP2F.
             03 CRDSTP2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP2I  PIC X(1).
           02  ACCTNO2L    COMP  PIC  S9(4).
           02  ACCTNO2F    PICTURE X.
           02  FILLER REDEFINES ACCTNO2F.
             03 ACCTNO2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO2I  PIC X(11).
           02  CRDNUM2L    COMP  PIC  S9(4).
           02  CRDNUM2F    PICTURE X.
           02  FILLER REDEFINES CRDNUM2F.
             03 CRDNUM2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM2I  PIC X(16).
           02  CRDSTS2L    COMP  PIC  S9(4).
           02  CRDSTS2F    PICTURE X.
           02  FILLER REDEFINES CRDSTS2F.
             03 CRDSTS2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS2I  PIC X(1).
           02  CRDSEL3L    COMP  PIC  S9(4).
           02  CRDSEL3F    PICTURE X.
           02  FILLER REDEFINES CRDSEL3F.
             03 CRDSEL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL3I  PIC X(1).
           02  CRDSTP3L    COMP  PIC  S9(4).
           02  CRDSTP3F    PICTURE X.
           02  FILLER REDEFINES CRDSTP3F.
             03 CRDSTP3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP3I  PIC X(1).
           02  ACCTNO3L    COMP  PIC  S9(4).
           02  ACCTNO3F    PICTURE X.
           02  FILLER REDEFINES ACCTNO3F.
             03 ACCTNO3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO3I  PIC X(11).
           02  CRDNUM3L    COMP  PIC  S9(4).
           02  CRDNUM3F    PICTURE X.
           02  FILLER REDEFINES CRDNUM3F.
             03 CRDNUM3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM3I  PIC X(16).
           02  CRDSTS3L    COMP  PIC  S9(4).
           02  CRDSTS3F    PICTURE X.
           02  FILLER REDEFINES CRDSTS3F.
             03 CRDSTS3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS3I  PIC X(1).
           02  CRDSEL4L    COMP  PIC  S9(4).
           02  CRDSEL4F    PICTURE X.
           02  FILLER REDEFINES CRDSEL4F.
             03 CRDSEL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL4I  PIC X(1).
           02  CRDSTP4L    COMP  PIC  S9(4).
           02  CRDSTP4F    PICTURE X.
           02  FILLER REDEFINES CRDSTP4F.
             03 CRDSTP4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP4I  PIC X(1).
           02  ACCTNO4L    COMP  PIC  S9(4).
           02  ACCTNO4F    PICTURE X.
           02  FILLER REDEFINES ACCTNO4F.
             03 ACCTNO4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO4I  PIC X(11).
           02  CRDNUM4L    COMP  PIC  S9(4).
           02  CRDNUM4F    PICTURE X.
           02  FILLER REDEFINES CRDNUM4F.
             03 CRDNUM4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM4I  PIC X(16).
           02  CRDSTS4L    COMP  PIC  S9(4).
           02  CRDSTS4F    PICTURE X.
           02  FILLER REDEFINES CRDSTS4F.
             03 CRDSTS4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS4I  PIC X(1).
           02  CRDSEL5L    COMP  PIC  S9(4).
           02  CRDSEL5F    PICTURE X.
           02  FILLER REDEFINES CRDSEL5F.
             03 CRDSEL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL5I  PIC X(1).
           02  CRDSTP5L    COMP  PIC  S9(4).
           02  CRDSTP5F    PICTURE X.
           02  FILLER REDEFINES CRDSTP5F.
             03 CRDSTP5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP5I  PIC X(1).
           02  ACCTNO5L    COMP  PIC  S9(4).
           02  ACCTNO5F    PICTURE X.
           02  FILLER REDEFINES ACCTNO5F.
             03 ACCTNO5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO5I  PIC X(11).
           02  CRDNUM5L    COMP  PIC  S9(4).
           02  CRDNUM5F    PICTURE X.
           02  FILLER REDEFINES CRDNUM5F.
             03 CRDNUM5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM5I  PIC X(16).
           02  CRDSTS5L    COMP  PIC  S9(4).
           02  CRDSTS5F    PICTURE X.
           02  FILLER REDEFINES CRDSTS5F.
             03 CRDSTS5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS5I  PIC X(1).
           02  CRDSEL6L    COMP  PIC  S9(4).
           02  CRDSEL6F    PICTURE X.
           02  FILLER REDEFINES CRDSEL6F.
             03 CRDSEL6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL6I  PIC X(1).
           02  CRDSTP6L    COMP  PIC  S9(4).
           02  CRDSTP6F    PICTURE X.
           02  FILLER REDEFINES CRDSTP6F.
             03 CRDSTP6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP6I  PIC X(1).
           02  ACCTNO6L    COMP  PIC  S9(4).
           02  ACCTNO6F    PICTURE X.
           02  FILLER REDEFINES ACCTNO6F.
             03 ACCTNO6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO6I  PIC X(11).
           02  CRDNUM6L    COMP  PIC  S9(4).
           02  CRDNUM6F    PICTURE X.
           02  FILLER REDEFINES CRDNUM6F.
             03 CRDNUM6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM6I  PIC X(16).
           02  CRDSTS6L    COMP  PIC  S9(4).
           02  CRDSTS6F    PICTURE X.
           02  FILLER REDEFINES CRDSTS6F.
             03 CRDSTS6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS6I  PIC X(1).
           02  CRDSEL7L    COMP  PIC  S9(4).
           02  CRDSEL7F    PICTURE X.
           02  FILLER REDEFINES CRDSEL7F.
             03 CRDSEL7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL7I  PIC X(1).
           02  CRDSTP7L    COMP  PIC  S9(4).
           02  CRDSTP7F    PICTURE X.
           02  FILLER REDEFINES CRDSTP7F.
             03 CRDSTP7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP7I  PIC X(1).
           02  ACCTNO7L    COMP  PIC  S9(4).
           02  ACCTNO7F    PICTURE X.
           02  FILLER REDEFINES ACCTNO7F.
             03 ACCTNO7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO7I  PIC X(11).
           02  CRDNUM7L    COMP  PIC  S9(4).
           02  CRDNUM7F    PICTURE X.
           02  FILLER REDEFINES CRDNUM7F.
             03 CRDNUM7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM7I  PIC X(16).
           02  CRDSTS7L    COMP  PIC  S9(4).
           02  CRDSTS7F    PICTURE X.
           02  FILLER REDEFINES CRDSTS7F.
             03 CRDSTS7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS7I  PIC X(1).
           02  INFOMSGL    COMP  PIC  S9(4).
           02  INFOMSGF    PICTURE X.
           02  FILLER REDEFINES INFOMSGF.
             03 INFOMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INFOMSGI  PIC X(45).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  CCRDLIAO REDEFINES CCRDLIAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PAGENOC    PICTURE X.
           02  PAGENOP    PICTURE X.
           02  PAGENOH    PICTURE X.
           02  PAGENOV    PICTURE X.
           02  PAGENOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACCTSIDC    PICTURE X.
           02  ACCTSIDP    PICTURE X.
           02  ACCTSIDH    PICTURE X.
           02  ACCTSIDV    PICTURE X.
           02  ACCTSIDO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CARDSIDC    PICTURE X.
           02  CARDSIDP    PICTURE X.
           02  CARDSIDH    PICTURE X.
           02  CARDSIDV    PICTURE X.
           02  CARDSIDO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSEL1C    PICTURE X.
           02  CRDSEL1P    PICTURE X.
           02  CRDSEL1H    PICTURE X.
           02  CRDSEL1V    PICTURE X.
           02  CRDSEL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO1C    PICTURE X.
           02  ACCTNO1P    PICTURE X.
           02  ACCTNO1H    PICTURE X.
           02  ACCTNO1V    PICTURE X.
           02  ACCTNO1O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM1C    PICTURE X.
           02  CRDNUM1P    PICTURE X.
           02  CRDNUM1H    PICTURE X.
           02  CRDNUM1V    PICTURE X.
           02  CRDNUM1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS1C    PICTURE X.
           02  CRDSTS1P    PICTURE X.
           02  CRDSTS1H    PICTURE X.
           02  CRDSTS1V    PICTURE X.
           02  CRDSTS1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL2C    PICTURE X.
           02  CRDSEL2P    PICTURE X.
           02  CRDSEL2H    PICTURE X.
           02  CRDSEL2V    PICTURE X.
           02  CRDSEL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP2C    PICTURE X.
           02  CRDSTP2P    PICTURE X.
           02  CRDSTP2H    PICTURE X.
           02  CRDSTP2V    PICTURE X.
           02  CRDSTP2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO2C    PICTURE X.
           02  ACCTNO2P    PICTURE X.
           02  ACCTNO2H    PICTURE X.
           02  ACCTNO2V    PICTURE X.
           02  ACCTNO2O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM2C    PICTURE X.
           02  CRDNUM2P    PICTURE X.
           02  CRDNUM2H    PICTURE X.
           02  CRDNUM2V    PICTURE X.
           02  CRDNUM2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS2C    PICTURE X.
           02  CRDSTS2P    PICTURE X.
           02  CRDSTS2H    PICTURE X.
           02  CRDSTS2V    PICTURE X.
           02  CRDSTS2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL3C    PICTURE X.
           02  CRDSEL3P    PICTURE X.
           02  CRDSEL3H    PICTURE X.
           02  CRDSEL3V    PICTURE X.
           02  CRDSEL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP3C    PICTURE X.
           02  CRDSTP3P    PICTURE X.
           02  CRDSTP3H    PICTURE X.
           02  CRDSTP3V    PICTURE X.
           02  CRDSTP3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO3C    PICTURE X.
           02  ACCTNO3P    PICTURE X.
           02  ACCTNO3H    PICTURE X.
           02  ACCTNO3V    PICTURE X.
           02  ACCTNO3O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM3C    PICTURE X.
           02  CRDNUM3P    PICTURE X.
           02  CRDNUM3H    PICTURE X.
           02  CRDNUM3V    PICTURE X.
           02  CRDNUM3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS3C    PICTURE X.
           02  CRDSTS3P    PICTURE X.
           02  CRDSTS3H    PICTURE X.
           02  CRDSTS3V    PICTURE X.
           02  CRDSTS3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL4C    PICTURE X.
           02  CRDSEL4P    PICTURE X.
           02  CRDSEL4H    PICTURE X.
           02  CRDSEL4V    PICTURE X.
           02  CRDSEL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP4C    PICTURE X.
           02  CRDSTP4P    PICTURE X.
           02  CRDSTP4H    PICTURE X.
           02  CRDSTP4V    PICTURE X.
           02  CRDSTP4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO4C    PICTURE X.
           02  ACCTNO4P    PICTURE X.
           02  ACCTNO4H    PICTURE X.
           02  ACCTNO4V    PICTURE X.
           02  ACCTNO4O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM4C    PICTURE X.
           02  CRDNUM4P    PICTURE X.
           02  CRDNUM4H    PICTURE X.
           02  CRDNUM4V    PICTURE X.
           02  CRDNUM4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS4C    PICTURE X.
           02  CRDSTS4P    PICTURE X.
           02  CRDSTS4H    PICTURE X.
           02  CRDSTS4V    PICTURE X.
           02  CRDSTS4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL5C    PICTURE X.
           02  CRDSEL5P    PICTURE X.
           02  CRDSEL5H    PICTURE X.
           02  CRDSEL5V    PICTURE X.
           02  CRDSEL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP5C    PICTURE X.
           02  CRDSTP5P    PICTURE X.
           02  CRDSTP5H    PICTURE X.
           02  CRDSTP5V    PICTURE X.
           02  CRDSTP5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO5C    PICTURE X.
           02  ACCTNO5P    PICTURE X.
           02  ACCTNO5H    PICTURE X.
           02  ACCTNO5V    PICTURE X.
           02  ACCTNO5O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM5C    PICTURE X.
           02  CRDNUM5P    PICTURE X.
           02  CRDNUM5H    PICTURE X.
           02  CRDNUM5V    PICTURE X.
           02  CRDNUM5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS5C    PICTURE X.
           02  CRDSTS5P    PICTURE X.
           02  CRDSTS5H    PICTURE X.
           02  CRDSTS5V    PICTURE X.
           02  CRDSTS5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL6C    PICTURE X.
           02  CRDSEL6P    PICTURE X.
           02  CRDSEL6H    PICTURE X.
           02  CRDSEL6V    PICTURE X.
           02  CRDSEL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP6C    PICTURE X.
           02  CRDSTP6P    PICTURE X.
           02  CRDSTP6H    PICTURE X.
           02  CRDSTP6V    PICTURE X.
           02  CRDSTP6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO6C    PICTURE X.
           02  ACCTNO6P    PICTURE X.
           02  ACCTNO6H    PICTURE X.
           02  ACCTNO6V    PICTURE X.
           02  ACCTNO6O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM6C    PICTURE X.
           02  CRDNUM6P    PICTURE X.
           02  CRDNUM6H    PICTURE X.
           02  CRDNUM6V    PICTURE X.
           02  CRDNUM6O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS6C    PICTURE X.
           02  CRDSTS6P    PICTURE X.
           02  CRDSTS6H    PICTURE X.
           02  CRDSTS6V    PICTURE X.
           02  CRDSTS6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL7C    PICTURE X.
           02  CRDSEL7P    PICTURE X.
           02  CRDSEL7H    PICTURE X.
           02  CRDSEL7V    PICTURE X.
           02  CRDSEL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP7C    PICTURE X.
           02  CRDSTP7P    PICTURE X.
           02  CRDSTP7H    PICTURE X.
           02  CRDSTP7V    PICTURE X.
           02  CRDSTP7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO7C    PICTURE X.
           02  ACCTNO7P    PICTURE X.
           02  ACCTNO7H    PICTURE X.
           02  ACCTNO7V    PICTURE X.
           02  ACCTNO7O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM7C    PICTURE X.
           02  CRDNUM7P    PICTURE X.
           02  CRDNUM7H    PICTURE X.
           02  CRDNUM7V    PICTURE X.
           02  CRDNUM7O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS7C    PICTURE X.
           02  CRDSTS7P    PICTURE X.
           02  CRDSTS7H    PICTURE X.
           02  CRDSTS7V    PICTURE X.
           02  CRDSTS7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(45).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
             
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01 WS-DATE-TIME.
         05 WS-CURDATE-DATA.
           10  WS-CURDATE.
             15  WS-CURDATE-YEAR         PIC 9(04).
             15  WS-CURDATE-MONTH        PIC 9(02).
             15  WS-CURDATE-DAY          PIC 9(02).
           10 WS-CURDATE-N REDEFINES WS-CURDATE PIC 9(08).
           10  WS-CURTIME.
             15  WS-CURTIME-HOURS        PIC 9(02).
             15  WS-CURTIME-MINUTE       PIC 9(02).
             15  WS-CURTIME-SECOND       PIC 9(02).
             15  WS-CURTIME-MILSEC       PIC 9(02).
           10 WS-CURTIME-N REDEFINES WS-CURTIME PIC 9(08).
         05 WS-CURDATE-MM-DD-YY.
           10  WS-CURDATE-MM             PIC 9(02).
           10  FILLER                    PIC X(01) VALUE '/'.
           10  WS-CURDATE-DD             PIC 9(02).
           10  FILLER                    PIC X(01) VALUE '/'.
           10  WS-CURDATE-YY             PIC 9(02).
         05 WS-CURTIME-HH-MM-SS.
           10  WS-CURTIME-HH             PIC 9(02).
           10  FILLER                    PIC X(01) VALUE ':'.
           10  WS-CURTIME-MM             PIC 9(02).
           10  FILLER                    PIC X(01) VALUE ':'.
           10  WS-CURTIME-SS             PIC 9(02).
         05 WS-TIMESTAMP.
           10  WS-TIMESTAMP-DT-YYYY      PIC 9(04).
           10  FILLER                    PIC X(01) VALUE '-'.
           10  WS-TIMESTAMP-DT-MM        PIC 9(02).
           10  FILLER                    PIC X(01) VALUE '-'.
           10  WS-TIMESTAMP-DT-DD        PIC 9(02).
           10  FILLER                    PIC X(01) VALUE ' '.
           10  WS-TIMESTAMP-TM-HH        PIC 9(02).
           10  FILLER                    PIC X(01) VALUE ':'.
           10  WS-TIMESTAMP-TM-MM        PIC 9(02).
           10  FILLER                    PIC X(01) VALUE ':'.
           10  WS-TIMESTAMP-TM-SS        PIC 9(02).
           10  FILLER                    PIC X(01) VALUE '.'.
           10  WS-TIMESTAMP-TM-MS6       PIC 9(06).
              
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01 CCDA-COMMON-MESSAGES.
         05 CCDA-MSG-THANK-YOU         PIC X(50) VALUE
              'Thank you for using CardDemo application...      '.
         05 CCDA-MSG-INVALID-KEY       PIC X(50) VALUE
              'Invalid key pressed. Please see below...         '.
              
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       01 SEC-USER-DATA.
         05 SEC-USR-ID                 PIC X(08).
         05 SEC-USR-FNAME              PIC X(20).
         05 SEC-USR-LNAME              PIC X(20).
         05 SEC-USR-PWD                PIC X(08).
         05 SEC-USR-TYPE               PIC X(01).
         05 SEC-USR-FILLER             PIC X(23).
              
       
       
       
       
       
       
       
       
       01  CARD-RECORD.
           05  CARD-NUM                          PIC X(16).
           05  CARD-ACCT-ID                      PIC 9(11).
           05  CARD-CVV-CD                       PIC 9(03).
           05  CARD-EMBOSSED-NAME                PIC X(50).
           05  CARD-EXPIRAION-DATE               PIC X(10).
           05  CARD-ACTIVE-STATUS                PIC X(01).
           05  FILLER                            PIC X(59).
              
       
       LINKAGE SECTION.
       01  DFHCOMMAREA.
         05  FILLER                                PIC X(1)
             OCCURS 1 TO 32767 TIMES DEPENDING ON EIBCALEN.
       
       PROCEDURE DIVISION.
       0000-MAIN.
       
           INITIALIZE CC-WORK-AREA
                      WS-MISC-STORAGE
                      WS-COMMAREA
       
       
       
       
           MOVE LIT-THISTRANID       TO WS-TRANID
       
       
       
           SET WS-ERROR-MSG-OFF  TO TRUE
       
       
       
           IF EIBCALEN = 0
              INITIALIZE CARDDEMO-COMMAREA
                         WS-THIS-PROGCOMMAREA
              MOVE LIT-THISTRANID        TO CDEMO-FROM-TRANID
              MOVE LIT-THISPGM           TO CDEMO-FROM-PROGRAM
              SET CDEMO-USRTYP-USER      TO TRUE
              SET CDEMO-PGM-ENTER        TO TRUE
              MOVE LIT-THISMAP           TO CDEMO-LAST-MAP
              MOVE LIT-THISMAPSET        TO CDEMO-LAST-MAPSET
              SET CA-FIRST-PAGE          TO TRUE
              SET CA-LAST-PAGE-NOT-SHOWN TO TRUE
           ELSE
              MOVE DFHCOMMAREA (1:LENGTH OF CARDDEMO-COMMAREA) TO
                                CARDDEMO-COMMAREA
              MOVE DFHCOMMAREA(LENGTH OF CARDDEMO-COMMAREA + 1:
                               LENGTH OF WS-THIS-PROGCOMMAREA )TO
                                WS-THIS-PROGCOMMAREA
           END-IF
       
       
       
           IF (CDEMO-PGM-ENTER
           AND CDEMO-FROM-PROGRAM NOT EQUAL LIT-THISPGM)
               INITIALIZE WS-THIS-PROGCOMMAREA
               SET CDEMO-PGM-ENTER      TO TRUE
               MOVE LIT-THISMAP         TO CDEMO-LAST-MAP
               SET CA-FIRST-PAGE        TO TRUE
               SET CA-LAST-PAGE-NOT-SHOWN TO TRUE
           END-IF
       
       
       
       
       
           PERFORM YYYY-STORE-PFKEY
              THRU YYYY-STORE-PFKEY-EXIT
       
       
       
       
       
       
           IF  EIBCALEN > 0
           AND CDEMO-FROM-PROGRAM  EQUAL LIT-THISPGM
               PERFORM 2000-RECEIVE-MAP
               THRU    2000-RECEIVE-MAP-EXIT
       
           END-IF
       
       
       
       
       
       
       
           SET PFK-INVALID TO TRUE
           IF CCARD-AID-ENTER OR
              CCARD-AID-PFK03 OR
              CCARD-AID-PFK07 OR
              CCARD-AID-PFK08
               SET PFK-VALID TO TRUE
           END-IF
       
           IF PFK-INVALID
              SET CCARD-AID-ENTER TO TRUE
           END-IF
       
       
       
           IF  (CCARD-AID-PFK03
           AND CDEMO-FROM-PROGRAM  EQUAL LIT-THISPGM)
              MOVE LIT-THISTRANID   TO CDEMO-FROM-TRANID
              MOVE LIT-THISPGM      TO CDEMO-FROM-PROGRAM
              SET  CDEMO-USRTYP-USER TO TRUE
              SET  CDEMO-PGM-ENTER  TO TRUE
              MOVE LIT-THISMAPSET   TO CDEMO-LAST-MAPSET
              MOVE LIT-THISMAP      TO CDEMO-LAST-MAP
              MOVE LIT-MENUPGM      TO CDEMO-TO-PROGRAM
       
              MOVE LIT-MENUMAPSET   TO CCARD-NEXT-MAPSET
              MOVE LIT-THISMAP      TO CCARD-NEXT-MAP
              SET WS-EXIT-MESSAGE            TO TRUE
       
       
       
              SET CDEMO-PGM-ENTER   TO TRUE
       
              _DIALECT_ 1 ???? ???? ????
                        ??????? ?????????????
              ????????
           END-IF
       
       
       
           IF CCARD-AID-PFK08
              CONTINUE
           ELSE
              SET CA-LAST-PAGE-NOT-SHOWN   TO TRUE
           END-IF
       
       
       
           EVALUATE TRUE
               WHEN INPUT-ERROR
       
       
       
                    MOVE WS-ERROR-MSG    TO CCARD-ERROR-MSG
                    MOVE LIT-THISPGM     TO CDEMO-FROM-PROGRAM
                    MOVE LIT-THISMAPSET  TO CDEMO-LAST-MAPSET
                    MOVE LIT-THISMAP     TO CDEMO-LAST-MAP
       
                    MOVE LIT-THISPGM     TO CCARD-NEXT-PROG
                    MOVE LIT-THISMAPSET  TO CCARD-NEXT-MAPSET
                    MOVE LIT-THISMAP     TO CCARD-NEXT-MAP
                    IF  NOT FLG-ACCTFILTER-NOT-OK
                    AND NOT FLG-CARDFILTER-NOT-OK
                       PERFORM 9000-READ-FORWARD
                          THRU 9000-READ-FORWARD-EXIT
                    END-IF
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP
                    GO TO COMMON-RETURN
               WHEN CCARD-AID-PFK07
                    AND CA-FIRST-PAGE
       
       
       
               WHEN CCARD-AID-PFK07
                    AND CA-FIRST-PAGE
                    MOVE WS-CA-FIRST-CARD-NUM
                                  TO WS-CARD-RID-CARDNUM
       
       
                    PERFORM 9000-READ-FORWARD
                       THRU 9000-READ-FORWARD-EXIT
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP
                    GO TO COMMON-RETURN
       
       
       
               WHEN CCARD-AID-PFK03
               WHEN CDEMO-PGM-REENTER AND
                    CDEMO-FROM-PROGRAM NOT EQUAL LIT-THISPGM
       
                    INITIALIZE CARDDEMO-COMMAREA
                               WS-THIS-PROGCOMMAREA
                    MOVE LIT-THISTRANID      TO CDEMO-FROM-TRANID
                    MOVE LIT-THISPGM         TO CDEMO-FROM-PROGRAM
                    SET CDEMO-USRTYP-USER    TO TRUE
                    SET CDEMO-PGM-ENTER      TO TRUE
                    MOVE LIT-THISMAP         TO CDEMO-LAST-MAP
                    MOVE LIT-THISMAPSET      TO CDEMO-LAST-MAPSET
                    SET CA-FIRST-PAGE        TO TRUE
                    SET CA-LAST-PAGE-NOT-SHOWN TO TRUE
       
                    MOVE WS-CA-FIRST-CARD-NUM
                                  TO WS-CARD-RID-CARDNUM
       
       
       
                    PERFORM 9000-READ-FORWARD
                       THRU 9000-READ-FORWARD-EXIT
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP
                    GO TO COMMON-RETURN
       
       
       
               WHEN CCARD-AID-PFK08
                    AND CA-NEXT-PAGE-EXISTS
                    MOVE WS-CA-LAST-CARD-NUM
                                  TO WS-CARD-RID-CARDNUM
       
       
                    ADD   +1       TO WS-CA-SCREEN-NUM
                    PERFORM 9000-READ-FORWARD
                       THRU 9000-READ-FORWARD-EXIT
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP-EXIT
                    GO TO COMMON-RETURN
       
       
       
               WHEN CCARD-AID-PFK07
                    AND NOT CA-FIRST-PAGE
       
                    MOVE WS-CA-FIRST-CARD-NUM
                                  TO WS-CARD-RID-CARDNUM
       
       
                    SUBTRACT 1    FROM WS-CA-SCREEN-NUM
                    PERFORM 9100-READ-BACKWARDS
                       THRU 9100-READ-BACKWARDS-EXIT
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP-EXIT
                    GO TO COMMON-RETURN
       
       
       
               WHEN CCARD-AID-ENTER
                AND VIEW-REQUESTED-ON(I-SELECTED)
                AND CDEMO-FROM-PROGRAM  EQUAL LIT-THISPGM
                   MOVE LIT-THISTRANID    TO CDEMO-FROM-TRANID
                   MOVE LIT-THISPGM       TO CDEMO-FROM-PROGRAM
                   SET  CDEMO-USRTYP-USER TO TRUE
                   SET  CDEMO-PGM-ENTER   TO TRUE
                   MOVE LIT-THISMAPSET    TO CDEMO-LAST-MAPSET
                   MOVE LIT-THISMAP       TO CDEMO-LAST-MAP
                   MOVE LIT-CARDDTLPGM    TO CCARD-NEXT-PROG
       
                   MOVE LIT-CARDDTLMAPSET TO CCARD-NEXT-MAPSET
                   MOVE LIT-CARDDTLMAP    TO CCARD-NEXT-MAP
       
                   MOVE WS-ROW-ACCTNO (I-SELECTED)
                                          TO CDEMO-ACCT-ID
                   MOVE WS-ROW-CARD-NUM (I-SELECTED)
                                          TO CDEMO-CARD-NUM
       
       
       
                   _DIALECT_ 2 ???? ???? ????
                        ??????? ?????????????????
                   ????????
       
       
       
               WHEN CCARD-AID-ENTER
                AND UPDATE-REQUESTED-ON(I-SELECTED)
                AND CDEMO-FROM-PROGRAM  EQUAL LIT-THISPGM
                   MOVE LIT-THISTRANID    TO CDEMO-FROM-TRANID
                   MOVE LIT-THISPGM       TO CDEMO-FROM-PROGRAM
                   SET  CDEMO-USRTYP-USER TO TRUE
                   SET  CDEMO-PGM-ENTER   TO TRUE
                   MOVE LIT-THISMAPSET    TO CDEMO-LAST-MAPSET
                   MOVE LIT-THISMAP       TO CDEMO-LAST-MAP
                   MOVE LIT-CARDUPDPGM    TO CCARD-NEXT-PROG
       
                   MOVE LIT-CARDUPDMAPSET TO CCARD-NEXT-MAPSET
                   MOVE LIT-CARDUPDMAP    TO CCARD-NEXT-MAP
       
                   MOVE WS-ROW-ACCTNO (I-SELECTED)
                                          TO CDEMO-ACCT-ID
                   MOVE WS-ROW-CARD-NUM (I-SELECTED)
                                          TO CDEMO-CARD-NUM
       
       
       
                   _DIALECT_ 3 ???? ???? ????
                        ??????? ?????????????????
                   ????????
       
       
               WHEN OTHER
       
                    MOVE WS-CA-FIRST-CARD-NUM
                                  TO WS-CARD-RID-CARDNUM
       
       
                    PERFORM 9000-READ-FORWARD
                       THRU 9000-READ-FORWARD-EXIT
                    PERFORM 1000-SEND-MAP
                       THRU 1000-SEND-MAP
                    GO TO COMMON-RETURN
           END-EVALUATE
       
       
           IF INPUT-ERROR
              MOVE WS-ERROR-MSG   TO CCARD-ERROR-MSG
              MOVE LIT-THISPGM     TO CDEMO-FROM-PROGRAM
              MOVE LIT-THISMAPSET  TO CDEMO-LAST-MAPSET
              MOVE LIT-THISMAP     TO CDEMO-LAST-MAP
       
              MOVE LIT-THISPGM     TO CCARD-NEXT-PROG
              MOVE LIT-THISMAPSET  TO CCARD-NEXT-MAPSET
              MOVE LIT-THISMAP     TO CCARD-NEXT-MAP
       
       
              GO TO COMMON-RETURN
           END-IF
       
           MOVE LIT-THISPGM        TO CCARD-NEXT-PROG
           GO TO COMMON-RETURN
           .
       
       COMMON-RETURN.
           MOVE  LIT-THISTRANID TO CDEMO-FROM-TRANID
           MOVE  LIT-THISPGM     TO CDEMO-FROM-PROGRAM
           MOVE  LIT-THISMAPSET  TO CDEMO-LAST-MAPSET
           MOVE  LIT-THISMAP     TO CDEMO-LAST-MAP
           MOVE  CARDDEMO-COMMAREA    TO WS-COMMAREA
           MOVE  WS-THIS-PROGCOMMAREA TO
                  WS-COMMAREA(LENGTH OF CARDDEMO-COMMAREA + 1:
                               LENGTH OF WS-THIS-PROGCOMMAREA )
       
       
           _DIALECT_ 4 ???? ???? ??????
                ??????? ????????????????
                ???????? ?????????????
           ????????
           .
       0000-MAIN-EXIT.
           EXIT
           .
       1000-SEND-MAP.
           PERFORM 1100-SCREEN-INIT
              THRU 1100-SCREEN-INIT-EXIT
           PERFORM 1200-SCREEN-ARRAY-INIT
              THRU 1200-SCREEN-ARRAY-INIT-EXIT
           PERFORM 1250-SETUP-ARRAY-ATTRIBS
              THRU 1250-SETUP-ARRAY-ATTRIBS-EXIT
           PERFORM 1300-SETUP-SCREEN-ATTRS
              THRU 1300-SETUP-SCREEN-ATTRS-EXIT
           PERFORM 1400-SETUP-MESSAGE
              THRU 1400-SETUP-MESSAGE-EXIT
           PERFORM 1500-SEND-SCREEN
              THRU 1500-SEND-SCREEN-EXIT
           .
       
       1000-SEND-MAP-EXIT.
           EXIT
           .
       1100-SCREEN-INIT.
           MOVE LOW-VALUES             TO CCRDLIAO
       
           MOVE FUNCTION CURRENT-DATE  TO WS-CURDATE-DATA
       
           MOVE CCDA-TITLE01           TO TITLE01O OF CCRDLIAO
           MOVE CCDA-TITLE02           TO TITLE02O OF CCRDLIAO
           MOVE LIT-THISTRANID         TO TRNNAMEO OF CCRDLIAO
           MOVE LIT-THISPGM            TO PGMNAMEO OF CCRDLIAO
       
           MOVE FUNCTION CURRENT-DATE  TO WS-CURDATE-DATA
       
           MOVE WS-CURDATE-MONTH       TO WS-CURDATE-MM
           MOVE WS-CURDATE-DAY         TO WS-CURDATE-DD
           MOVE WS-CURDATE-YEAR(3:2)   TO WS-CURDATE-YY
       
           MOVE WS-CURDATE-MM-DD-YY    TO CURDATEO OF CCRDLIAO
       
           MOVE WS-CURTIME-HOURS       TO WS-CURTIME-HH
           MOVE WS-CURTIME-MINUTE      TO WS-CURTIME-MM
           MOVE WS-CURTIME-SECOND      TO WS-CURTIME-SS
       
           MOVE WS-CURTIME-HH-MM-SS    TO CURTIMEO OF CCRDLIAO
       
       
           MOVE WS-CA-SCREEN-NUM       TO PAGENOO  OF CCRDLIAO
       
           SET WS-NO-INFO-MESSAGE      TO TRUE
           MOVE WS-INFO-MSG            TO INFOMSGO OF CCRDLIAO
           MOVE DFHBMDAR               TO INFOMSGC OF CCRDLIAO
           .
       
       1100-SCREEN-INIT-EXIT.
           EXIT
           .
       
       1200-SCREEN-ARRAY-INIT.
       
           IF   WS-EACH-CARD(1)            EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(1)       TO CRDSEL1O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(1)        TO ACCTNO1O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(1)      TO CRDNUM1O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(1)   TO CRDSTS1O OF CCRDLIAO
           END-IF
       
           IF   WS-EACH-CARD(2)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(2)       TO CRDSEL2O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(2)        TO ACCTNO2O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(2)      TO CRDNUM2O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(2)   TO CRDSTS2O OF CCRDLIAO
           END-IF
       
           IF   WS-EACH-CARD(3)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(3)       TO CRDSEL3O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(3)        TO ACCTNO3O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(3)      TO CRDNUM3O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(3)   TO CRDSTS3O OF CCRDLIAO
           END-IF
       
           IF   WS-EACH-CARD(4)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(4)       TO CRDSEL4O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(4)        TO ACCTNO4O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(4)      TO CRDNUM4O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(4)   TO CRDSTS4O OF CCRDLIAO
           END-IF
       
           IF   WS-EACH-CARD(5)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(5)       TO CRDSEL5O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(5)        TO ACCTNO5O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(5)      TO CRDNUM5O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(5)   TO CRDSTS5O OF CCRDLIAO
           END-IF
       
       
           IF   WS-EACH-CARD(6)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(6)       TO CRDSEL6O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(6)        TO ACCTNO6O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(6)      TO CRDNUM6O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(6)   TO CRDSTS6O OF CCRDLIAO
           END-IF
       
           IF   WS-EACH-CARD(7)        EQUAL LOW-VALUES
              CONTINUE
           ELSE
              MOVE WS-EDIT-SELECT(7)       TO CRDSEL7O OF CCRDLIAO
              MOVE WS-ROW-ACCTNO(7)        TO ACCTNO7O OF CCRDLIAO
              MOVE WS-ROW-CARD-NUM(7)      TO CRDNUM7O OF CCRDLIAO
              MOVE WS-ROW-CARD-STATUS(7)   TO CRDSTS7O OF CCRDLIAO
           END-IF
           .
       
       1200-SCREEN-ARRAY-INIT-EXIT.
           EXIT
           .
       1250-SETUP-ARRAY-ATTRIBS.
       
       
           IF   WS-EACH-CARD(1)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRF                TO CRDSEL1A OF CCRDLIAI
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(1) = '1'
                 MOVE DFHRED               TO CRDSEL1C OF CCRDLIAO
                 IF WS-EDIT-SELECT(1) = SPACE OR LOW-VALUES
                    MOVE '*'               TO CRDSEL1O OF CCRDLIAO
                 END-IF
              END-IF
              MOVE DFHBMFSE                TO CRDSEL1A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(2)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL2A OF CCRDLIAI
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(2) = '1'
                 MOVE DFHRED               TO CRDSEL2C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL2L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL2A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(3)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL3A OF CCRDLIAI
       
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(3) = '1'
                 MOVE DFHRED               TO CRDSEL3C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL3L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL3A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(4)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL4A OF CCRDLIAI
              I
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(4) = '1'
                 MOVE DFHRED               TO CRDSEL4C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL4L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL4A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(5)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL5A OF CCRDLIAI
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(5) = '1'
                 MOVE DFHRED               TO CRDSEL5C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL5L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL5A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(6)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL6A OF CCRDLIAI
       
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(6) = '1'
                 MOVE DFHRED               TO CRDSEL6C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL6L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL6A OF CCRDLIAI
           END-IF
       
           IF   WS-EACH-CARD(7)            EQUAL LOW-VALUES
           OR   FLG-PROTECT-SELECT-ROWS-YES
              MOVE DFHBMPRO                TO CRDSEL7A OF CCRDLIAI
           ELSE
              IF WS-ROW-CRDSELECT-ERROR(7) = '1'
                 MOVE DFHRED               TO CRDSEL7C OF CCRDLIAO
                 MOVE -1                   TO CRDSEL7L OF CCRDLIAI
              END-IF
              MOVE DFHBMFSE                TO CRDSEL7A OF CCRDLIAI
           END-IF
           .
       
       1250-SETUP-ARRAY-ATTRIBS-EXIT.
           EXIT
           .
       1300-SETUP-SCREEN-ATTRS.
       
           IF EIBCALEN = 0
           OR (CDEMO-PGM-ENTER
           AND CDEMO-FROM-PROGRAM = LIT-MENUPGM)
              CONTINUE
           ELSE
              EVALUATE TRUE
                  WHEN FLG-ACCTFILTER-ISVALID
                  WHEN FLG-ACCTFILTER-NOT-OK
                     MOVE CC-ACCT-ID   TO ACCTSIDO OF CCRDLIAO
                     MOVE DFHBMFSE     TO ACCTSIDA OF CCRDLIAI
                  WHEN CDEMO-ACCT-ID = 0
                     MOVE LOW-VALUES   TO ACCTSIDO OF CCRDLIAO
                  WHEN OTHER
                    MOVE CDEMO-ACCT-ID TO ACCTSIDO OF CCRDLIAO
                    MOVE DFHBMFSE      TO ACCTSIDA OF CCRDLIAI
              END-EVALUATE
       
              EVALUATE TRUE
                  WHEN FLG-CARDFILTER-ISVALID
                  WHEN FLG-CARDFILTER-NOT-OK
                     MOVE CC-CARD-NUM  TO CARDSIDO OF CCRDLIAO
                     MOVE DFHBMFSE     TO CARDSIDA OF CCRDLIAI
                  WHEN CDEMO-CARD-NUM = 0
                     MOVE LOW-VALUES   TO CARDSIDO OF CCRDLIAO
                  WHEN OTHER
                    MOVE CDEMO-CARD-NUM
                                       TO CARDSIDO OF CCRDLIAO
                    MOVE DFHBMFSE      TO CARDSIDA OF CCRDLIAI
              END-EVALUATE
           END-IF
       
       
       
           IF FLG-ACCTFILTER-NOT-OK
              MOVE  DFHRED             TO ACCTSIDC OF CCRDLIAO
              MOVE  -1                 TO ACCTSIDL OF CCRDLIAI
           END-IF
       
           IF FLG-CARDFILTER-NOT-OK
              MOVE  DFHRED             TO CARDSIDC OF CCRDLIAO
              MOVE  -1                 TO CARDSIDL OF CCRDLIAI
           END-IF
       
       
       
           IF INPUT-OK
             MOVE   -1                 TO ACCTSIDL OF CCRDLIAI
           END-IF
       
       
           .
       1300-SETUP-SCREEN-ATTRS-EXIT.
           EXIT
           .
       
       
       1400-SETUP-MESSAGE.
       
           EVALUATE TRUE
                WHEN FLG-ACCTFILTER-NOT-OK
                WHEN FLG-CARDFILTER-NOT-OK
                  CONTINUE
                WHEN CCARD-AID-PFK07
                    AND CA-FIRST-PAGE
                  MOVE 'NO PREVIOUS PAGES TO DISPLAY'
                  TO WS-ERROR-MSG
                WHEN CCARD-AID-PFK08
                 AND CA-NEXT-PAGE-NOT-EXISTS
                 AND CA-LAST-PAGE-SHOWN
                  MOVE 'NO MORE PAGES TO DISPLAY'
                  TO WS-ERROR-MSG
                WHEN CCARD-AID-PFK08
                 AND CA-NEXT-PAGE-NOT-EXISTS
                  SET WS-INFORM-REC-ACTIONS TO TRUE
                  IF  CA-LAST-PAGE-NOT-SHOWN
                  AND CA-NEXT-PAGE-NOT-EXISTS
                      SET CA-LAST-PAGE-SHOWN TO TRUE
                  END-IF
                WHEN WS-NO-INFO-MESSAGE
                WHEN CA-NEXT-PAGE-EXISTS
                  SET WS-INFORM-REC-ACTIONS TO TRUE
                WHEN OTHER
                   SET WS-NO-INFO-MESSAGE TO TRUE
           END-EVALUATE
       
           MOVE WS-ERROR-MSG          TO ERRMSGO OF CCRDLIAO
       
           IF  NOT WS-NO-INFO-MESSAGE
           AND NOT WS-NO-RECORDS-FOUND
              MOVE WS-INFO-MSG        TO INFOMSGO OF CCRDLIAO
              MOVE DFHNEUTR           TO INFOMSGC OF CCRDLIAO
           END-IF
       
           .
       1400-SETUP-MESSAGE-EXIT.
           EXIT
           .
       
       
       1500-SEND-SCREEN.
           _DIALECT_ 5 ???? ???? ???? ????????????????
                          ??????????????????????
                          ??????????????
                          ??????
                          ?????
                          ????????????????
           ????????
           .
       1500-SEND-SCREEN-EXIT.
           EXIT
           .
       2000-RECEIVE-MAP.
           PERFORM 2100-RECEIVE-SCREEN
              THRU 2100-RECEIVE-SCREEN-EXIT
       
           PERFORM 2200-EDIT-INPUTS
            THRU   2200-EDIT-INPUTS-EXIT
           .
       
       2000-RECEIVE-MAP-EXIT.
           EXIT
           .
       2100-RECEIVE-SCREEN.
           _DIALECT_ 6 ???? ???? ??????? ????????????????
                          ??????????????????????
                          ??????????????
           ????????
       
           MOVE ACCTSIDI OF CCRDLIAI  TO CC-ACCT-ID
           MOVE CARDSIDI OF CCRDLIAI  TO CC-CARD-NUM
       
           MOVE CRDSEL1I OF CCRDLIAI  TO WS-EDIT-SELECT(1)
           MOVE CRDSEL2I OF CCRDLIAI  TO WS-EDIT-SELECT(2)
           MOVE CRDSEL3I OF CCRDLIAI  TO WS-EDIT-SELECT(3)
           MOVE CRDSEL4I OF CCRDLIAI  TO WS-EDIT-SELECT(4)
           MOVE CRDSEL5I OF CCRDLIAI  TO WS-EDIT-SELECT(5)
           MOVE CRDSEL6I OF CCRDLIAI  TO WS-EDIT-SELECT(6)
           MOVE CRDSEL7I OF CCRDLIAI  TO WS-EDIT-SELECT(7)
           .
       
       2100-RECEIVE-SCREEN-EXIT.
           EXIT
           .
       
       2200-EDIT-INPUTS.
           SET INPUT-OK                   TO TRUE
           SET FLG-PROTECT-SELECT-ROWS-NO TO TRUE
       
           PERFORM 2210-EDIT-ACCOUNT
              THRU 2210-EDIT-ACCOUNT-EXIT
       
           PERFORM 2220-EDIT-CARD
              THRU 2220-EDIT-CARD-EXIT
       
           PERFORM 2250-EDIT-ARRAY
              THRU 2250-EDIT-ARRAY-EXIT
           .
       
       2200-EDIT-INPUTS-EXIT.
           EXIT
           .
       
       2210-EDIT-ACCOUNT.
           SET FLG-ACCTFILTER-BLANK TO TRUE
       
       
           IF CC-ACCT-ID   EQUAL LOW-VALUES
           OR CC-ACCT-ID   EQUAL SPACES
           OR CC-ACCT-ID-N EQUAL ZEROS
              SET FLG-ACCTFILTER-BLANK  TO TRUE
              MOVE ZEROES       TO CDEMO-ACCT-ID
              GO TO  2210-EDIT-ACCOUNT-EXIT
           END-IF
       
       
       
           IF CC-ACCT-ID  IS NOT NUMERIC
              SET INPUT-ERROR TO TRUE
              SET FLG-ACCTFILTER-NOT-OK TO TRUE
              SET FLG-PROTECT-SELECT-ROWS-YES TO TRUE
              MOVE
              'ACCOUNT FILTER,IF SUPPLIED MUST BE A 11 DIGIT NUMBER'
                              TO WS-ERROR-MSG
              MOVE ZERO       TO CDEMO-ACCT-ID
              GO TO 2210-EDIT-ACCOUNT-EXIT
           ELSE
              MOVE CC-ACCT-ID TO CDEMO-ACCT-ID
              SET FLG-ACCTFILTER-ISVALID TO TRUE
           END-IF
           .
       
       2210-EDIT-ACCOUNT-EXIT.
           EXIT
           .
       
       2220-EDIT-CARD.
       
       
           SET FLG-CARDFILTER-BLANK TO TRUE
       
       
           IF CC-CARD-NUM   EQUAL LOW-VALUES
           OR CC-CARD-NUM   EQUAL SPACES
           OR CC-CARD-NUM-N EQUAL ZEROS
              SET FLG-CARDFILTER-BLANK  TO TRUE
              MOVE ZEROES       TO CDEMO-CARD-NUM
              GO TO  2220-EDIT-CARD-EXIT
           END-IF
       
       
       
           IF CC-CARD-NUM  IS NOT NUMERIC
              SET INPUT-ERROR TO TRUE
              SET FLG-CARDFILTER-NOT-OK TO TRUE
              SET FLG-PROTECT-SELECT-ROWS-YES TO TRUE
              IF WS-ERROR-MSG-OFF
                 MOVE
              'CARD ID FILTER,IF SUPPLIED MUST BE A 16 DIGIT NUMBER'
                              TO WS-ERROR-MSG
              END-IF
              MOVE ZERO       TO CDEMO-CARD-NUM
              GO TO 2220-EDIT-CARD-EXIT
           ELSE
              MOVE CC-CARD-NUM-N TO CDEMO-CARD-NUM
              SET FLG-CARDFILTER-ISVALID TO TRUE
           END-IF
           .
       
       2220-EDIT-CARD-EXIT.
           EXIT
           .
       
       2250-EDIT-ARRAY.
       
           IF INPUT-ERROR
              GO TO 2250-EDIT-ARRAY-EXIT
           END-IF
       
           INSPECT  WS-EDIT-SELECT-FLAGS
           TALLYING I
           FOR ALL 'S'
               ALL 'U'
       
           IF I > +1
               SET INPUT-ERROR      TO TRUE
               SET WS-MORE-THAN-1-ACTION TO TRUE
       
               MOVE WS-EDIT-SELECT-FLAGS
                                   TO WS-EDIT-SELECT-ERROR-FLAGS
               INSPECT WS-EDIT-SELECT-ERROR-FLAGS
                 REPLACING ALL 'S' BY '1'
                           ALL 'U' BY '1'
                 CHARACTERS        BY '0'
       
           END-IF
       
           MOVE ZERO TO I-SELECTED
       
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 7
               EVALUATE TRUE
                 WHEN SELECT-OK(I)
                   MOVE I TO I-SELECTED
                   IF WS-MORE-THAN-1-ACTION
                      MOVE '1' TO WS-ROW-CRDSELECT-ERROR(I)
                   END-IF
                 WHEN SELECT-BLANK(I)
                   CONTINUE
                 WHEN OTHER
                   SET INPUT-ERROR TO TRUE
                   MOVE '1' TO WS-ROW-CRDSELECT-ERROR(I)
                   IF WS-ERROR-MSG-OFF
                      SET WS-INVALID-ACTION-CODE TO TRUE
                   END-IF
              END-EVALUATE
           END-PERFORM
       
           .
       
       2250-EDIT-ARRAY-EXIT.
           EXIT
           .
       
       9000-READ-FORWARD.
           MOVE LOW-VALUES           TO WS-ALL-ROWS
       
       
       
       
           _DIALECT_ 7 ???? ???? ???????
                ??????????????????????
                ???????????????????????????
                ???????????????? ?? ????????????????????
                ????
                ????????????????
           ????????
       
       
       
           MOVE ZEROES TO WS-SCRN-COUNTER
           SET CA-NEXT-PAGE-EXISTS    TO TRUE
           SET MORE-RECORDS-TO-READ   TO TRUE
       
           PERFORM UNTIL READ-LOOP-EXIT
       
           _DIALECT_ 8 ???? ???? ????????
                ??????????????????????
                ???? ?????????????
                ????????????? ?? ????????????
                ???????????????????????????
                ???????????????? ?? ????????????????????
                ????????????????
           ????????
       
           EVALUATE WS-RESP-CD
               WHEN _DIALECT_ 9 ???????????????
               WHEN _DIALECT_ 10 ???????????????
                   PERFORM 9500-FILTER-RECORDS
                      THRU 9500-FILTER-RECORDS-EXIT
       
                   IF WS-DONOT-EXCLUDE-THIS-RECORD
                      ADD 1             TO WS-SCRN-COUNTER
       
                      MOVE CARD-NUM     TO WS-ROW-CARD-NUM(
                      WS-SCRN-COUNTER)
                      MOVE CARD-ACCT-ID TO
                      WS-ROW-ACCTNO(WS-SCRN-COUNTER)
                      MOVE CARD-ACTIVE-STATUS
                                        TO WS-ROW-CARD-STATUS(
                                        WS-SCRN-COUNTER)
       
                      IF WS-SCRN-COUNTER = 1
                         MOVE CARD-ACCT-ID
                                        TO WS-CA-FIRST-CARD-ACCT-ID
                         MOVE CARD-NUM  TO WS-CA-FIRST-CARD-NUM
                         IF   WS-CA-SCREEN-NUM = 0
                           ADD   +1     TO WS-CA-SCREEN-NUM
                         ELSE
                           CONTINUE
                         END-IF
                      ELSE
                         CONTINUE
                      END-IF
                   ELSE
                       CONTINUE
                   END-IF
       
       
       
                   IF WS-SCRN-COUNTER = WS-MAX-SCREEN-LINES
                      SET READ-LOOP-EXIT  TO TRUE
       
                      MOVE CARD-ACCT-ID     TO WS-CA-LAST-CARD-ACCT-ID
                      MOVE CARD-NUM         TO WS-CA-LAST-CARD-NUM
       
                      _DIALECT_ 11 ???? ???? ????????
                        ??????????????????????
                        ???? ?????????????
                        ????????????? ?? ????????????
                        ???????????????????????????
                        ???????????????? ?? ????????????????????
                        ????????????????
                      ????????
       
                      EVALUATE WS-RESP-CD
                         WHEN _DIALECT_ 12 ???????????????
                         WHEN _DIALECT_ 13 ???????????????
                              SET CA-NEXT-PAGE-EXISTS
                                                TO TRUE
                              MOVE CARD-ACCT-ID TO
                                   WS-CA-LAST-CARD-ACCT-ID
                              MOVE CARD-NUM     TO WS-CA-LAST-CARD-NUM
                        WHEN _DIALECT_ 14 ????????????????
                            SET CA-NEXT-PAGE-NOT-EXISTS     TO TRUE
       
                            IF WS-ERROR-MSG-OFF
                                MOVE 'NO MORE RECORDS TO SHOW'
                                                TO WS-ERROR-MSG
                            END-IF
                            WHEN OTHER
       
       
                            SET READ-LOOP-EXIT      TO TRUE
                            MOVE 'READ'              TO ERROR-OPNAME
                            MOVE LIT-CARD-FILE       TO ERROR-FILE
                            MOVE WS-RESP-CD          TO ERROR-RESP
                            MOVE WS-REAS-CD          TO ERROR-RESP2
                          MOVE WS-FILE-ERROR-MESSAGE TO WS-ERROR-MSG
                      END-EVALUATE
                  END-IF
               WHEN _DIALECT_ 15 ????????????????
                  SET READ-LOOP-EXIT              TO TRUE
                  SET CA-NEXT-PAGE-NOT-EXISTS     TO TRUE
                  MOVE CARD-ACCT-ID     TO WS-CA-LAST-CARD-ACCT-ID
                  MOVE CARD-NUM         TO WS-CA-LAST-CARD-NUM
                  IF WS-ERROR-MSG-OFF
                     MOVE 'NO MORE RECORDS TO SHOW'  TO WS-ERROR-MSG
                  END-IF
                  IF WS-CA-SCREEN-NUM = 1
                  AND WS-SCRN-COUNTER = 0
       
                      SET WS-NO-RECORDS-FOUND    TO TRUE
                  END-IF
               WHEN OTHER
       
       
                  SET READ-LOOP-EXIT             TO TRUE
                  MOVE 'READ'                     TO ERROR-OPNAME
                  MOVE LIT-CARD-FILE              TO ERROR-FILE
                  MOVE WS-RESP-CD                 TO ERROR-RESP
                  MOVE WS-REAS-CD                 TO ERROR-RESP2
                  MOVE WS-FILE-ERROR-MESSAGE      TO WS-ERROR-MSG
           END-EVALUATE
           END-PERFORM
       
           _DIALECT_ 16 ???? ???? ????? ???????????????????
           ????????
           .
       9000-READ-FORWARD-EXIT.
           EXIT
           .
       9100-READ-BACKWARDS.
       
           MOVE LOW-VALUES           TO WS-ALL-ROWS
       
           MOVE WS-CA-FIRST-CARDKEY  TO WS-CA-LAST-CARDKEY
       
       
       
       
           _DIALECT_ 17 ???? ???? ???????
                ??????????????????????
                ???????????????????????????
                ???????????????? ?? ????????????????????
                ????
                ????????????????
           ????????
       
       
       
           COMPUTE WS-SCRN-COUNTER =
                                   WS-MAX-SCREEN-LINES + 1
           END-COMPUTE
           SET CA-NEXT-PAGE-EXISTS    TO TRUE
           SET MORE-RECORDS-TO-READ   TO TRUE
       
       
       
       
       
           _DIALECT_ 18 ???? ???? ????????
                ??????????????????????
                ???? ?????????????
                ????????????? ?? ????????????
                ???????????????????????????
                ???????????????? ?? ????????????????????
                ????????????????
           ????????
       
           EVALUATE WS-RESP-CD
               WHEN _DIALECT_ 19 ???????????????
               WHEN _DIALECT_ 20 ???????????????
                   SUBTRACT 1          FROM WS-SCRN-COUNTER
               WHEN OTHER
       
       
                  SET READ-LOOP-EXIT             TO TRUE
                  MOVE 'READ'                     TO ERROR-OPNAME
                  MOVE LIT-CARD-FILE              TO ERROR-FILE
                  MOVE WS-RESP-CD                 TO ERROR-RESP
                  MOVE WS-REAS-CD                 TO ERROR-RESP2
                  MOVE WS-FILE-ERROR-MESSAGE      TO WS-ERROR-MSG
                  GO TO 9100-READ-BACKWARDS-EXIT
           END-EVALUATE
       
           PERFORM UNTIL READ-LOOP-EXIT
       
           _DIALECT_ 21 ???? ???? ????????
                ??????????????????????
                ???? ?????????????
                ????????????? ?? ????????????
                ???????????????????????????
                ???????????????? ?? ????????????????????
                ????????????????
           ????????
       
           EVALUATE WS-RESP-CD
               WHEN _DIALECT_ 22 ???????????????
               WHEN _DIALECT_ 23 ???????????????
                   PERFORM 9500-FILTER-RECORDS
                      THRU 9500-FILTER-RECORDS-EXIT
                   IF WS-DONOT-EXCLUDE-THIS-RECORD
                      MOVE CARD-NUM
                                  TO WS-ROW-CARD-NUM(WS-SCRN-COUNTER)
                      MOVE CARD-ACCT-ID
                                  TO WS-ROW-ACCTNO(WS-SCRN-COUNTER)
                      MOVE CARD-ACTIVE-STATUS
                                  TO
                                  WS-ROW-CARD-STATUS(WS-SCRN-COUNTER)
       
                      SUBTRACT 1  FROM WS-SCRN-COUNTER
                      IF WS-SCRN-COUNTER = 0
                         SET READ-LOOP-EXIT  TO TRUE
       
                         MOVE CARD-ACCT-ID
                                  TO WS-CA-FIRST-CARD-ACCT-ID
                         MOVE CARD-NUM
                                  TO WS-CA-FIRST-CARD-NUM
                      ELSE
                         CONTINUE
                      END-IF
                   ELSE
                       CONTINUE
                   END-IF
       
               WHEN OTHER
       
       
                  SET READ-LOOP-EXIT             TO TRUE
                  MOVE 'READ'                     TO ERROR-OPNAME
                  MOVE LIT-CARD-FILE              TO ERROR-FILE
                  MOVE WS-RESP-CD                 TO ERROR-RESP
                  MOVE WS-REAS-CD                 TO ERROR-RESP2
                  MOVE WS-FILE-ERROR-MESSAGE      TO WS-ERROR-MSG
           END-EVALUATE
           END-PERFORM
           .
       
       9100-READ-BACKWARDS-EXIT.
           _DIALECT_ 24 ???? ????
           ????????
       
           EXIT
           .
       
       9500-FILTER-RECORDS.
           SET WS-DONOT-EXCLUDE-THIS-RECORD TO TRUE
       
           IF FLG-ACCTFILTER-ISVALID
              IF  CARD-ACCT-ID = CC-ACCT-ID
                  CONTINUE
              ELSE
                  SET WS-EXCLUDE-THIS-RECORD  TO TRUE
                  GO TO 9500-FILTER-RECORDS-EXIT
              END-IF
           ELSE
             CONTINUE
           END-IF
       
           IF FLG-CARDFILTER-ISVALID
              IF  CARD-NUM = CC-CARD-NUM-N
                  CONTINUE
              ELSE
                  SET WS-EXCLUDE-THIS-RECORD TO TRUE
                  GO TO 9500-FILTER-RECORDS-EXIT
              END-IF
           ELSE
             CONTINUE
           END-IF
       
           .
       
       9500-FILTER-RECORDS-EXIT.
           EXIT
           .
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       
       YYYY-STORE-PFKEY.
       
       
       
           EVALUATE TRUE
             WHEN EIBAID IS EQUAL TO DFHENTER
               SET CCARD-AID-ENTER TO TRUE
             WHEN EIBAID IS EQUAL TO DFHCLEAR
               SET CCARD-AID-CLEAR TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPA1
               SET CCARD-AID-PA1  TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPA2
               SET CCARD-AID-PA2  TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF1
               SET CCARD-AID-PFK01 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF2
               SET CCARD-AID-PFK02 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF3
               SET CCARD-AID-PFK03 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF4
               SET CCARD-AID-PFK04 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF5
               SET CCARD-AID-PFK05 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF6
               SET CCARD-AID-PFK06 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF7
               SET CCARD-AID-PFK07 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF8
               SET CCARD-AID-PFK08 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF9
               SET CCARD-AID-PFK09 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF10
               SET CCARD-AID-PFK10 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF11
               SET CCARD-AID-PFK11 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF12
               SET CCARD-AID-PFK12 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF13
               SET CCARD-AID-PFK01 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF14
               SET CCARD-AID-PFK02 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF15
               SET CCARD-AID-PFK03 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF16
               SET CCARD-AID-PFK04 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF17
               SET CCARD-AID-PFK05 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF18
               SET CCARD-AID-PFK06 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF19
               SET CCARD-AID-PFK07 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF20
               SET CCARD-AID-PFK08 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF21
               SET CCARD-AID-PFK09 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF22
               SET CCARD-AID-PFK10 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF23
               SET CCARD-AID-PFK11 TO TRUE
             WHEN EIBAID IS EQUAL TO DFHPF24
               SET CCARD-AID-PFK12 TO TRUE
           END-EVALUATE
           .
       YYYY-STORE-PFKEY-EXIT.
           EXIT
           .
               
            
       
       
       
       
       SEND-PLAIN-TEXT.
           _DIALECT_ 25 ???? ???? ???? ????
                     ??????????????????
                     ????????????? ?? ?????????????
                     ?????
           ????????
       
           _DIALECT_ 26 ???? ???? ??????
           ????????
           .
       SEND-PLAIN-TEXT-EXIT.
           EXIT
           .
       
       
       
       
       
       SEND-LONG-TEXT.
           _DIALECT_ 27 ???? ???? ???? ????
                     ?????????????????
                     ????????????? ?? ????????????
                     ?????
           ????????
       
           _DIALECT_ 28 ???? ???? ??????
           ????????
           .
       SEND-LONG-TEXT-EXIT.
           EXIT
           .
       
       
       
       
        
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 1: EXEC CICSXCTLPROGRAM(LIT-MENUPGM)COMMAREA(CARDDEMO-COMMAREA)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 2: EXEC CICSXCTLPROGRAM(CCARD-NEXT-PROG)COMMAREA(CARDDEMO-COMMAREA)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 3: EXEC CICSXCTLPROGRAM(CCARD-NEXT-PROG)COMMAREA(CARDDEMO-COMMAREA)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 4: EXEC CICSRETURNTRANSID(LIT-THISTRANID)COMMAREA(WS-COMMAREA)LENGTH(LENGTHOFWS-COMMAREA)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 5: EXEC CICSSENDMAP(LIT-THISMAP)MAPSET(LIT-THISMAPSET)FROM(CCRDLIAO)CURSORERASERESP(WS-RESP-CD)FREEKBEND-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 6: EXEC CICSRECEIVEMAP(LIT-THISMAP)MAPSET(LIT-THISMAPSET)INTO(CCRDLIAI)RESP(WS-RESP-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 7: EXEC CICSSTARTBRDATASET(LIT-CARD-FILE)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)GTEQRESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 8: EXEC CICSREADNEXTDATASET(LIT-CARD-FILE)INTO(CARD-RECORD)LENGTH(LENGTHOFCARD-RECORD)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)RESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 9: DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 10: DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 11: EXEC CICSREADNEXTDATASET(LIT-CARD-FILE)INTO(CARD-RECORD)LENGTH(LENGTHOFCARD-RECORD)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)RESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 12: DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 13: DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 14: DFHRESP(ENDFILE) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 15: DFHRESP(ENDFILE) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 16: EXEC CICSENDBRFILE(LIT-CARD-FILE)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 17: EXEC CICSSTARTBRDATASET(LIT-CARD-FILE)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)GTEQRESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 18: EXEC CICSREADPREVDATASET(LIT-CARD-FILE)INTO(CARD-RECORD)LENGTH(LENGTHOFCARD-RECORD)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)RESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 19: DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 20: DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 21: EXEC CICSREADPREVDATASET(LIT-CARD-FILE)INTO(CARD-RECORD)LENGTH(LENGTHOFCARD-RECORD)RIDFLD(WS-CARD-RID-CARDNUM)KEYLENGTH(LENGTHOFWS-CARD-RID-CARDNUM)RESP(WS-RESP-CD)RESP2(WS-REAS-CD)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 22: DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 23: DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 24: EXEC CICSENDBRFILE(LIT-CARD-FILE)END-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 25: EXEC CICSSENDTEXTFROM(WS-ERROR-MSG)LENGTH(LENGTHOFWS-ERROR-MSG)ERASEFREEKBEND-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 26: EXEC CICSRETURNEND-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 27: EXEC CICSSENDTEXTFROM(WS-LONG-MSG)LENGTH(LENGTHOFWS-LONG-MSG)ERASEFREEKBEND-EXEC 
[2026-05-02 14:01:49] [FINER] Restoring _DIALECT_ 28: EXEC CICSRETURNEND-EXEC 
[2026-05-02 14:01:49] [INFO] Restored 28 nodes. 
[2026-05-02 14:01:49] [INFO] Building tree... 
[2026-05-02 14:01:49] [INFO] Built tree 
[2026-05-02 14:01:49] [FINER] Setting value for 01WS-MISC-STORAGE. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-CICS-PROCESSNG-VARS. 
[2026-05-02 14:01:49] [FINER] Setting value for 07WS-RESP-CDPICS9(09)COMPVALUEZEROS. 
[2026-05-02 14:01:49] [FINER] Setting value for 07WS-REAS-CDPICS9(09)COMPVALUEZEROS. 
[2026-05-02 14:01:49] [FINER] Setting value for 07WS-TRANIDPICX(4)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-INPUT-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-ACCT-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-CARD-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-SELECT-COUNTERPICS9(04)USAGECOMP-3VALUE0. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-SELECT-FLAGSPICX(7)VALUELOW-VALUES. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-SELECT-ARRAYREDEFINESWS-EDIT-SELECT-FLAGS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-EDIT-SELECTPICX(1)OCCURS7TIMES. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-SELECT-ERROR-FLAGSPICX(7). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-EDIT-SELECT-ERROR-FLAGXREDEFINESWS-EDIT-SELECT-ERROR-FLAGS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-EDIT-SELECT-ERRORSOCCURS7TIMES. 
[2026-05-02 14:01:49] [FINER] Setting value for 20WS-ROW-CRDSELECT-ERRORPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-SUBSCRIPT-VARS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10IPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [FINER] Setting value for 10I-SELECTEDPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CICS-OUTPUT-EDIT-VARS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CARD-ACCT-ID-XPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CARD-ACCT-ID-NREDEFINESCARD-ACCT-ID-XPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CARD-CVV-CD-XPICX(03). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CARD-CVV-CD-NREDEFINESCARD-CVV-CD-XPIC9(03). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FLG-PROTECT-SELECT-ROWSPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-LONG-MSGPICX(500). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-INFO-MSGPICX(45). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-ERROR-MSGPICX(75). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-PFK-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-CONTEXT-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-FILE-HANDLING-VARS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CARD-RID. 
[2026-05-02 14:01:49] [FINER] Setting value for 20WS-CARD-RID-CARDNUMPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 20WS-CARD-RID-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 20WS-CARD-RID-ACCT-ID-XREDEFINESWS-CARD-RID-ACCT-IDPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-SCRN-COUNTERPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-FILTER-RECORD-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-RECORDS-TO-PROCESS-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-FILE-ERROR-MESSAGE. 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(12)VALUE'File Error:'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10ERROR-OPNAMEPICX(8)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(4)VALUE' on '. 
[2026-05-02 14:01:49] [FINER] Setting value for 10ERROR-FILEPICX(9)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(15)VALUE' returned RESP '. 
[2026-05-02 14:01:49] [FINER] Setting value for 10ERROR-RESPPICX(10)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(7)VALUE',RESP2 '. 
[2026-05-02 14:01:49] [FINER] Setting value for 10ERROR-RESP2PICX(10)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(5). 
[2026-05-02 14:01:49] [FINER] Setting value for 01WS-CONSTANTS. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-MAX-SCREEN-LINESPICS9(4)COMPVALUE7. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-THISPGMPICX(8)VALUE'COCRDLIC'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-THISTRANIDPICX(4)VALUE'CCLI'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-THISMAPSETPICX(7)VALUE'COCRDLI'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-THISMAPPICX(7)VALUE'CCRDLIA'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-MENUPGMPICX(8)VALUE'COMEN01C'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-MENUTRANIDPICX(4)VALUE'CM00'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-MENUMAPSETPICX(7)VALUE'COMEN01'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-MENUMAPPICX(7)VALUE'COMEN1A'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDDTLPGMPICX(8)VALUE'COCRDSLC'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDDTLTRANIDPICX(4)VALUE'CCDL'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDDTLMAPSETPICX(7)VALUE'COCRDSL'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDDTLMAPPICX(7)VALUE'CCRDSLA'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDUPDPGMPICX(8)VALUE'COCRDUPC'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDUPDTRANIDPICX(4)VALUE'CCUP'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDUPDMAPSETPICX(7)VALUE'COCRDUP'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARDUPDMAPPICX(7)VALUE'CCRDUPA'. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARD-FILEPICX(8)VALUE'CARDDAT '. 
[2026-05-02 14:01:49] [FINER] Setting value for 05LIT-CARD-FILE-ACCT-PATHPICX(8)VALUE'CARDAIX '. 
[2026-05-02 14:01:49] [FINER] Setting value for 01CC-WORK-AREAS. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CC-WORK-AREA. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-AIDPICX(5). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-NEXT-PROGPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-NEXT-MAPSETPICX(7). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-NEXT-MAPPICX(7). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-ERROR-MSGPICX(75). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CCARD-RETURN-MSGPICX(75). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-ACCT-IDPICX(11)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-ACCT-ID-NREDEFINESCC-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-CARD-NUMPICX(16)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-CARD-NUM-NREDEFINESCC-CARD-NUMPIC9(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-CUST-IDPICX(09)VALUESPACES. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CC-CUST-ID-NREDEFINESCC-CUST-IDPIC9(9). 
[2026-05-02 14:01:49] [FINER] Setting value for 01CARDDEMO-COMMAREA. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CDEMO-GENERAL-INFO. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-FROM-TRANIDPICX(04). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-FROM-PROGRAMPICX(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-TO-TRANIDPICX(04). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-TO-PROGRAMPICX(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-USER-IDPICX(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-USER-TYPEPICX(01). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-PGM-CONTEXTPIC9(01). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CDEMO-CUSTOMER-INFO. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-CUST-IDPIC9(09). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-CUST-FNAMEPICX(25). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-CUST-MNAMEPICX(25). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-CUST-LNAMEPICX(25). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CDEMO-ACCOUNT-INFO. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-ACCT-STATUSPICX(01). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CDEMO-CARD-INFO. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-CARD-NUMPIC9(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CDEMO-MORE-INFO. 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-LAST-MAPPICX(7). 
[2026-05-02 14:01:49] [FINER] Setting value for 10CDEMO-LAST-MAPSETPICX(7). 
[2026-05-02 14:01:49] [FINER] Setting value for 01WS-THIS-PROGCOMMAREA. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CA-LAST-CARDKEY. 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CA-LAST-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CA-LAST-CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CA-FIRST-CARDKEY. 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CA-FIRST-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CA-FIRST-CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CA-SCREEN-NUMPIC9(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CA-LAST-PAGE-DISPLAYEDPIC9(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CA-NEXT-PAGE-INDPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-RETURN-FLAGPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-SCREEN-DATA. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-ALL-ROWSPICX(196). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERREDEFINESWS-ALL-ROWS. 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-SCREEN-ROWSOCCURS7TIMES. 
[2026-05-02 14:01:49] [FINER] Setting value for 20WS-EACH-ROW. 
[2026-05-02 14:01:49] [FINER] Setting value for 25WS-EACH-CARD. 
[2026-05-02 14:01:49] [FINER] Setting value for 30WS-ROW-ACCTNOPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 30WS-ROW-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 30WS-ROW-CARD-STATUSPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 01WS-COMMAREAPICX(2000). 
[2026-05-02 14:01:49] [FINER] Setting value for 01CCDA-SCREEN-TITLE. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CCDA-TITLE01PICX(40)VALUE'      AWS Mainframe Modernization       '. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CCDA-TITLE02PICX(40)VALUE'              CardDemo                  '. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CCDA-THANK-YOUPICX(40)VALUE'Thank you for using CCDA application... '. 
[2026-05-02 14:01:49] [FINER] Setting value for 01CCRDLIAI. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICX(12). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESTRNNAMEF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03TRNNAMEAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEIPICX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESTITLE01F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03TITLE01APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01IPICX(40). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATELCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCURDATEF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CURDATEAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEIPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESPGMNAMEF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03PGMNAMEAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEIPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESTITLE02F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03TITLE02APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02IPICX(40). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCURTIMEF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CURTIMEAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEIPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOLCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESPAGENOF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03PAGENOAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOIPICX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDLCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTSIDF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTSIDAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDIPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDLCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCARDSIDF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CARDSIDAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDIPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL1F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL1APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO1F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO1APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM1F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM1APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS1F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS1APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL2F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL2APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP2F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP2APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO2F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO2APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM2F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM2APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS2F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS2APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL3F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL3APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP3F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP3APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO3F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO3APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM3F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM3APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS3F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS3APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL4F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL4APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP4F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP4APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO4F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO4APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM4F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM4APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS4F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS4APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL5F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL5APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP5F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP5APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO5F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO5APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM5F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM5APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS5F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS5APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL6F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL6APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP6F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP6APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO6F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO6APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM6F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM6APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS6F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS6APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSEL7F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSEL7APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTP7F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTP7APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESACCTNO7F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ACCTNO7APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7IPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDNUM7F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDNUM7APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7IPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7FPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESCRDSTS7F. 
[2026-05-02 14:01:49] [FINER] Setting value for 03CRDSTS7APICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7IPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGLCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESINFOMSGF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03INFOMSGAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGIPICX(45). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGLCOMPPICS9(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGFPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERREDEFINESERRMSGF. 
[2026-05-02 14:01:49] [FINER] Setting value for 03ERRMSGAPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGIPICX(78). 
[2026-05-02 14:01:49] [FINER] Setting value for 01CCRDLIAOREDEFINESCCRDLIAI. 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICX(12). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMECPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TRNNAMEOPICX(4). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE01OPICX(40). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATECPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURDATEOPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMECPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PGMNAMEOPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02TITLE02OPICX(40). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMECPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CURTIMEOPICX(8). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOCPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02PAGENOOPICX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDCPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTSIDOPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDCPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CARDSIDOPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL1OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO1OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM1OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS1OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL2OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP2OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO2OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM2OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS2OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL3OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP3OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO3OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM3OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS3OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL4OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP4OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO4OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM4OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS4OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL5OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP5OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO5OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM5OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS5OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL6OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP6OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO6OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM6OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS6OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSEL7OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTP7OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ACCTNO7OPICX(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDNUM7OPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7CPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7PPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7HPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7VPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02CRDSTS7OPICX(1). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGCPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02INFOMSGOPICX(45). 
[2026-05-02 14:01:49] [FINER] Setting value for 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGCPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGPPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGHPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGVPICTUREX. 
[2026-05-02 14:01:49] [FINER] Setting value for 02ERRMSGOPICX(78). 
[2026-05-02 14:01:49] [FINER] Setting value for 01WS-DATE-TIME. 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-CURDATE-DATA. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURDATE. 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURDATE-YEARPIC9(04). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURDATE-MONTHPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURDATE-DAYPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURDATE-NREDEFINESWS-CURDATEPIC9(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURTIME. 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURTIME-HOURSPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURTIME-MINUTEPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURTIME-SECONDPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 15WS-CURTIME-MILSECPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURTIME-NREDEFINESWS-CURTIMEPIC9(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-CURDATE-MM-DD-YY. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURDATE-MMPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE'/'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURDATE-DDPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE'/'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURDATE-YYPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-CURTIME-HH-MM-SS. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURTIME-HHPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURTIME-MMPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-CURTIME-SSPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 05WS-TIMESTAMP. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-DT-YYYYPIC9(04). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE'-'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-DT-MMPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE'-'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-DT-DDPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE' '. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-TM-HHPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-TM-MMPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-TM-SSPIC9(02). 
[2026-05-02 14:01:49] [FINER] Setting value for 10FILLERPICX(01)VALUE'.'. 
[2026-05-02 14:01:49] [FINER] Setting value for 10WS-TIMESTAMP-TM-MS6PIC9(06). 
[2026-05-02 14:01:49] [FINER] Setting value for 01CCDA-COMMON-MESSAGES. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CCDA-MSG-THANK-YOUPICX(50)VALUE'Thank you for using CardDemo application...      '. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CCDA-MSG-INVALID-KEYPICX(50)VALUE'Invalid key pressed. Please see below...         '. 
[2026-05-02 14:01:49] [FINER] Setting value for 01SEC-USER-DATA. 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-IDPICX(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-FNAMEPICX(20). 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-LNAMEPICX(20). 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-PWDPICX(08). 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-TYPEPICX(01). 
[2026-05-02 14:01:49] [FINER] Setting value for 05SEC-USR-FILLERPICX(23). 
[2026-05-02 14:01:49] [FINER] Setting value for 01CARD-RECORD. 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-CVV-CDPIC9(03). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-EMBOSSED-NAMEPICX(50). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-EXPIRAION-DATEPICX(10). 
[2026-05-02 14:01:49] [FINER] Setting value for 05CARD-ACTIVE-STATUSPICX(01). 
[2026-05-02 14:01:49] [FINER] Setting value for 05FILLERPICX(59). 
[2026-05-02 14:01:49] [FINER] Setting value for 01DFHCOMMAREA. 
[2026-05-02 14:01:49] [FINER] Setting value for 05FILLERPICX(1)OCCURS1TO32767TIMESDEPENDINGONEIBCALEN. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 07WS-RESP-CDPICS9(09)COMPVALUEZEROS. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 07WS-REAS-CDPICS9(09)COMPVALUEZEROS. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 07WS-TRANIDPICX(4)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-INPUT-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-EDIT-ACCT-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-EDIT-CARD-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-EDIT-SELECT-COUNTERPICS9(04)USAGECOMP-3VALUE0. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-EDIT-SELECT-FLAGSPICX(7)VALUELOW-VALUES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-EDIT-SELECTPICX(1)OCCURS7TIMES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-EDIT-SELECT-ERROR-FLAGSPICX(7). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 20WS-ROW-CRDSELECT-ERRORPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10IPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10I-SELECTEDPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CARD-ACCT-ID-XPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CARD-ACCT-ID-NREDEFINESCARD-ACCT-ID-XPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CARD-CVV-CD-XPICX(03). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CARD-CVV-CD-NREDEFINESCARD-CVV-CD-XPIC9(03). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FLG-PROTECT-SELECT-ROWSPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-LONG-MSGPICX(500). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-INFO-MSGPICX(45). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-ERROR-MSGPICX(75). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-PFK-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-CONTEXT-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 20WS-CARD-RID-CARDNUMPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 20WS-CARD-RID-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 20WS-CARD-RID-ACCT-ID-XREDEFINESWS-CARD-RID-ACCT-IDPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-SCRN-COUNTERPICS9(4)COMPVALUE0. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-FILTER-RECORD-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-RECORDS-TO-PROCESS-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(12)VALUE'File Error:'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10ERROR-OPNAMEPICX(8)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(4)VALUE' on '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10ERROR-FILEPICX(9)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(15)VALUE' returned RESP '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10ERROR-RESPPICX(10)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(7)VALUE',RESP2 '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10ERROR-RESP2PICX(10)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(5). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05WS-MAX-SCREEN-LINESPICS9(4)COMPVALUE7. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-THISPGMPICX(8)VALUE'COCRDLIC'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-THISTRANIDPICX(4)VALUE'CCLI'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-THISMAPSETPICX(7)VALUE'COCRDLI'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-THISMAPPICX(7)VALUE'CCRDLIA'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-MENUPGMPICX(8)VALUE'COMEN01C'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-MENUTRANIDPICX(4)VALUE'CM00'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-MENUMAPSETPICX(7)VALUE'COMEN01'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-MENUMAPPICX(7)VALUE'COMEN1A'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDDTLPGMPICX(8)VALUE'COCRDSLC'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDDTLTRANIDPICX(4)VALUE'CCDL'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDDTLMAPSETPICX(7)VALUE'COCRDSL'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDDTLMAPPICX(7)VALUE'CCRDSLA'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDUPDPGMPICX(8)VALUE'COCRDUPC'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDUPDTRANIDPICX(4)VALUE'CCUP'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDUPDMAPSETPICX(7)VALUE'COCRDUP'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARDUPDMAPPICX(7)VALUE'CCRDUPA'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARD-FILEPICX(8)VALUE'CARDDAT '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05LIT-CARD-FILE-ACCT-PATHPICX(8)VALUE'CARDAIX '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-AIDPICX(5). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-NEXT-PROGPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-NEXT-MAPSETPICX(7). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-NEXT-MAPPICX(7). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-ERROR-MSGPICX(75). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CCARD-RETURN-MSGPICX(75). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-ACCT-IDPICX(11)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-ACCT-ID-NREDEFINESCC-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-CARD-NUMPICX(16)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-CARD-NUM-NREDEFINESCC-CARD-NUMPIC9(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-CUST-IDPICX(09)VALUESPACES. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CC-CUST-ID-NREDEFINESCC-CUST-IDPIC9(9). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-FROM-TRANIDPICX(04). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-FROM-PROGRAMPICX(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-TO-TRANIDPICX(04). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-TO-PROGRAMPICX(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-USER-IDPICX(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-USER-TYPEPICX(01). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-PGM-CONTEXTPIC9(01). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-CUST-IDPIC9(09). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-CUST-FNAMEPICX(25). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-CUST-MNAMEPICX(25). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-CUST-LNAMEPICX(25). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-ACCT-STATUSPICX(01). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-CARD-NUMPIC9(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-LAST-MAPPICX(7). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10CDEMO-LAST-MAPSETPICX(7). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CA-LAST-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CA-LAST-CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CA-FIRST-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CA-FIRST-CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CA-SCREEN-NUMPIC9(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CA-LAST-PAGE-DISPLAYEDPIC9(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CA-NEXT-PAGE-INDPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-RETURN-FLAGPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-ALL-ROWSPICX(196). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 30WS-ROW-ACCTNOPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 30WS-ROW-CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 30WS-ROW-CARD-STATUSPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 01WS-COMMAREAPICX(2000). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CCDA-TITLE01PICX(40)VALUE'      AWS Mainframe Modernization       '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CCDA-TITLE02PICX(40)VALUE'              CardDemo                  '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CCDA-THANK-YOUPICX(40)VALUE'Thank you for using CCDA application... '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICX(12). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03TRNNAMEAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEIPICX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03TITLE01APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01IPICX(40). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATELCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CURDATEAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEIPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03PGMNAMEAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEIPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03TITLE02APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02IPICX(40). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMELCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CURTIMEAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEIPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOLCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03PAGENOAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOIPICX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDLCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTSIDAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDIPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDLCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CARDSIDAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDIPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL1APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO1APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM1APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS1APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL2APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP2APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO2APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM2APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS2APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL3APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP3APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO3APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM3APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS3APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL4APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP4APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO4APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM4APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS4APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL5APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP5APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO5APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM5APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS5APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL6APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP6APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO6APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM6APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS6APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSEL7APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTP7APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ACCTNO7APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7IPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDNUM7APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7IPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7LCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7FPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03CRDSTS7APICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7IPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGLCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03INFOMSGAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGIPICX(45). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGLCOMPPICS9(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGFPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 03ERRMSGAPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGIPICX(78). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICX(12). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMECPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TRNNAMEOPICX(4). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE01OPICX(40). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATECPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURDATEOPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMECPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PGMNAMEOPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02TITLE02OPICX(40). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMECPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CURTIMEOPICX(8). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOCPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02PAGENOOPICX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDCPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTSIDOPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDCPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CARDSIDOPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL1OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO1OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM1OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS1OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL2OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP2OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO2OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM2OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS2OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL3OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP3OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO3OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM3OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS3OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL4OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP4OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO4OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM4OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS4OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL5OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP5OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO5OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM5OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS5OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL6OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP6OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO6OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM6OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS6OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSEL7OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTP7OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ACCTNO7OPICX(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDNUM7OPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7CPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7PPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7HPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7VPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02CRDSTS7OPICX(1). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGCPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02INFOMSGOPICX(45). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02FILLERPICTUREX(3). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGCPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGPPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGHPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGVPICTUREX. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 02ERRMSGOPICX(78). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURDATE-YEARPIC9(04). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURDATE-MONTHPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURDATE-DAYPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURDATE-NREDEFINESWS-CURDATEPIC9(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURTIME-HOURSPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURTIME-MINUTEPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURTIME-SECONDPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 15WS-CURTIME-MILSECPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURTIME-NREDEFINESWS-CURTIMEPIC9(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURDATE-MMPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE'/'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURDATE-DDPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE'/'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURDATE-YYPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURTIME-HHPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURTIME-MMPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-CURTIME-SSPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-DT-YYYYPIC9(04). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE'-'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-DT-MMPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE'-'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-DT-DDPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE' '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-TM-HHPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-TM-MMPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE':'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-TM-SSPIC9(02). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10FILLERPICX(01)VALUE'.'. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 10WS-TIMESTAMP-TM-MS6PIC9(06). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CCDA-MSG-THANK-YOUPICX(50)VALUE'Thank you for using CardDemo application...      '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CCDA-MSG-INVALID-KEYPICX(50)VALUE'Invalid key pressed. Please see below...         '. 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-IDPICX(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-FNAMEPICX(20). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-LNAMEPICX(20). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-PWDPICX(08). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-TYPEPICX(01). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05SEC-USR-FILLERPICX(23). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-NUMPICX(16). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-ACCT-IDPIC9(11). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-CVV-CDPIC9(03). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-EMBOSSED-NAMEPICX(50). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-EXPIRAION-DATEPICX(10). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05CARD-ACTIVE-STATUSPICX(01). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05FILLERPICX(59). 
[2026-05-02 14:01:49] [INFO] Calculating type spec for single data structure: 05FILLERPICX(1)OCCURS1TO32767TIMESDEPENDINGONEIBCALEN. 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [WS-EDIT-SELECT-ARRAY] redefinition of group record [WS-EDIT-SELECT-FLAGS] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [WS-EDIT-SELECT-ERROR-FLAGX] redefinition of group record [WS-EDIT-SELECT-ERROR-FLAGS] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CARD-ACCT-ID-N] redefinition of atomic record [CARD-ACCT-ID-X] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CARD-CVV-CD-N] redefinition of atomic record [CARD-CVV-CD-X] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [WS-CARD-RID-ACCT-ID-X] redefinition of atomic record [WS-CARD-RID-ACCT-ID] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CC-ACCT-ID-N] redefinition of atomic record [CC-ACCT-ID] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CC-CARD-NUM-N] redefinition of atomic record [CC-CARD-NUM] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CC-CUST-ID-N] redefinition of atomic record [CC-CUST-ID] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [WS-ALL-ROWS] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [TRNNAMEF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [TITLE01F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CURDATEF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [PGMNAMEF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [TITLE02F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CURTIMEF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [PAGENOF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTSIDF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CARDSIDF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL1F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO1F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM1F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS1F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL2F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP2F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO2F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM2F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS2F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL3F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP3F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO3F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM3F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS3F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL4F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP4F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO4F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM4F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS4F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL5F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP5F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO5F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM5F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS5F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL6F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP6F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO6F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM6F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS6F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSEL7F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTP7F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ACCTNO7F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDNUM7F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [CRDSTS7F] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [INFOMSGF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [FILLER] redefinition of group record [ERRMSGF] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [CCRDLIAO] redefinition of group record [CCRDLIAI] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [WS-CURDATE-N] redefinition of atomic record [WS-CURDATE] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Building [WS-CURTIME-N] redefinition of atomic record [WS-CURTIME] 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [INFO] Building redefinitions... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [FINER] Inspecting Redefinitions of [ROOT] ... 
[2026-05-02 14:01:49] [INFO] {
  "timings": {
    "Compiler Directives processing": 0.0025377,
    "Preprocessing": 0.1029061,
    "Dialects processing": 0.0099153,
    "dialects compiler directives processing": 0.2013496,
    "Implicit dialects processing": 0.2463737,
    "Parsing stage": 0.7646366,
    "total": 1.327719
  }
} 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_1???? ???? ??????????? ?????????????????????EXEC CICS XCTL
                        PROGRAM (LIT-MENUPGM)
                        COMMAREA(CARDDEMO-COMMAREA)
              END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_2???? ???? ??????????? ?????????????????????????EXEC CICS XCTL
                        PROGRAM (CCARD-NEXT-PROG)
                        COMMAREA(CARDDEMO-COMMAREA)
                   END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_3???? ???? ??????????? ?????????????????????????EXEC CICS XCTL
                        PROGRAM (CCARD-NEXT-PROG)
                        COMMAREA(CARDDEMO-COMMAREA)
                   END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_4???? ???? ????????????? ???????????????????????? ?????????????????????EXEC CICS RETURN
                TRANSID (LIT-THISTRANID)
                COMMAREA (WS-COMMAREA)
                LENGTH(LENGTH OF WS-COMMAREA)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_5???? ???? ???? ???????????????????????????????????????????????????????????????????????????????????????EXEC CICS SEND MAP(LIT-THISMAP)
                          MAPSET(LIT-THISMAPSET)
                          FROM(CCRDLIAO)
                          CURSOR
                          ERASE
                          RESP(WS-RESP-CD)
                          FREEKB
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_6???? ???? ??????? ????????????????????????????????????????????????????????????EXEC CICS RECEIVE MAP(LIT-THISMAP)
                          MAPSET(LIT-THISMAPSET)
                          INTO(CCRDLIAI)
                          RESP(WS-RESP-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_7???? ???? ???????????????????????????????????????????????????????????????????????? ?? ????????????????????????????????????????????????EXEC CICS STARTBR
                DATASET(LIT-CARD-FILE)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                GTEQ
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_8???? ???? ?????????????????????????????????? ?????????????????????????? ?? ??????????????????????????????????????????????????????? ?? ????????????????????????????????????????????EXEC CICS READNEXT
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_9???????????????DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_10???????????????DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_11???? ???? ?????????????????????????????????? ?????????????????????????? ?? ??????????????????????????????????????????????????????? ?? ????????????????????????????????????????????EXEC CICS READNEXT
                        DATASET(LIT-CARD-FILE)
                        INTO (CARD-RECORD)
                        LENGTH(LENGTH OF CARD-RECORD)
                        RIDFLD(WS-CARD-RID-CARDNUM)
                        KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                        RESP(WS-RESP-CD)
                        RESP2(WS-REAS-CD)
                      END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_12???????????????DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_13???????????????DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_14????????????????DFHRESP(ENDFILE) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_15????????????????DFHRESP(ENDFILE) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_16???? ???? ????? ???????????????????????????EXEC CICS ENDBR FILE(LIT-CARD-FILE)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_17???? ???? ???????????????????????????????????????????????????????????????????????? ?? ????????????????????????????????????????????????EXEC CICS STARTBR
                DATASET(LIT-CARD-FILE)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                GTEQ
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_18???? ???? ?????????????????????????????????? ?????????????????????????? ?? ??????????????????????????????????????????????????????? ?? ????????????????????????????????????????????EXEC CICS READPREV
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_19???????????????DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_20???????????????DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_21???? ???? ?????????????????????????????????? ?????????????????????????? ?? ??????????????????????????????????????????????????????? ?? ????????????????????????????????????????????EXEC CICS READPREV
                DATASET(LIT-CARD-FILE)
                INTO (CARD-RECORD)
                LENGTH(LENGTH OF CARD-RECORD)
                RIDFLD(WS-CARD-RID-CARDNUM)
                KEYLENGTH(LENGTH OF WS-CARD-RID-CARDNUM)
                RESP(WS-RESP-CD)
                RESP2(WS-REAS-CD)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_22???????????????DFHRESP(NORMAL) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_23???????????????DFHRESP(DUPREC) 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_24???? ????????????EXEC CICS
                ENDBR FILE(LIT-CARD-FILE)
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_25???? ???? ???? ??????????????????????????????????? ?? ??????????????????????????EXEC CICS SEND TEXT
                     FROM(WS-ERROR-MSG)
                     LENGTH(LENGTH OF WS-ERROR-MSG)
                     ERASE
                     FREEKB
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_26???? ???? ??????????????EXEC CICS RETURN
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_27???? ???? ???? ?????????????????????????????????? ?? ?????????????????????????EXEC CICS SEND TEXT
                     FROM(WS-LONG-MSG)
                     LENGTH(LENGTH OF WS-LONG-MSG)
                     ERASE
                     FREEKB
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Adding to repository dialect node _DIALECT_28???? ???? ??????????????EXEC CICS RETURN
           END-EXEC 
[2026-05-02 14:01:49] [INFO] Memory usage: 551086888 
[2026-05-02 14:01:49] [FINE] Building flow for ProcedureDivisionBodyContext/262f631f-d1e2-4c77-8ed1-320404625aec 
[2026-05-02 14:01:49] [FINE] Building internal flow for ProcedureDivisionBodyContext/262f631f-d1e2-4c77-8ed1-320404625aec 
[2026-05-02 14:01:49] [FINE] Building flow for 0000-MAIN 
[2026-05-02 14:01:49] [FINE] Building flow for INITIALIZECC-WO 
[2026-05-02 14:01:49] [FINE] Building internal flow for INITIALIZECC-WO 
[2026-05-02 14:01:49] [FINE] Building flow for INITIALIZECC-WO 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISTRA 
[2026-05-02 14:01:49] [FINE] Building flow for SETWS-ERROR-MSG 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
EIBCALEN = 0?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for INITIALIZECARDD 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISTRA 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISPGM 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-USRTYP 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-PGM-EN 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for SETCA-FIRST-PAG 
[2026-05-02 14:01:49] [FINE] Building flow for SETCA-LAST-PAGE 
[2026-05-02 14:01:49] [FINE] Building flow for No 
[2026-05-02 14:01:49] [FINE] Building internal flow for No 
[2026-05-02 14:01:49] [FINE] Building flow for ELSE 
[2026-05-02 14:01:49] [FINE] Building flow for MOVEDFHCOMMAREA 
[2026-05-02 14:01:49] [FINE] Building flow for MOVEDFHCOMMAREA 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
(CDEMO-PGM-ENTER
           AND CDEMO-FR?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for INITIALIZEWS-TH 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-PGM-EN 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for SETCA-FIRST-PAG 
[2026-05-02 14:01:49] [FINE] Building flow for SETCA-LAST-PAGE 
[2026-05-02 14:01:49] [FINE] Building flow for PERFORMYYYY-STO 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
EIBCALEN > 0
           AND CDEMO-FROM-P?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for PERFORM2000-REC 
[2026-05-02 14:01:49] [FINE] Building flow for SETPFK-INVALIDT 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
CCARD-AID-ENTER OR
              CCARD-A?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for SETPFK-VALIDTOT 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
PFK-INVALID?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for SETCCARD-AID-EN 
[2026-05-02 14:01:49] [FINE] Building flow for IS 
(CCARD-AID-PFK03
           AND CDEMO-FR?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISTRA 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISPGM 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-USRTYP 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-PGM-EN 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-MENUPGM 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-MENUMAP 
[2026-05-02 14:01:49] [FINE] Building flow for MOVELIT-THISMAP 
[2026-05-02 14:01:49] [FINE] Building flow for SETWS-EXIT-MESS 
[2026-05-02 14:01:49] [FINE] Building flow for SETCDEMO-PGM-EN 
[2026-05-02 14:01:49] [FINE] Building flow for _DIALECT_1????  
[2026-05-02 14:01:49] [FINE] Building flow for IS 
CCARD-AID-PFK08?
 
[2026-05-02 14:01:49] [FINE] Building flow for Yes 
[2026-05-02 14:01:49] [FINE] Building internal flow for Yes 
[2026-05-02 14:01:49] [FINE] Building flow for CONTINUE 
[2026-05-02 14:01:49] [FINE] Building flow for No 
[2026-05-02 14:01:49] [FINE] Building internal flow for No 
[2026-05-02 14:01:49] [FINE] Building flow for ELSE 
[2026-05-02 14:01:49] [FINE] Building flow for SETCA-LAST-PAGE 
[2026-05-02 14:01:49] [FINE] Building flow for EVALUATE 
[2026-05-02 14:01:49] [FINER] Visiting condition: CCARD-AID-PFK07ANDCA-FIRST-PAGE 
[2026-05-02 14:01:49] [FINER] Visiting condition: CCARD-AID-PFK07ANDCA-FIRST-PAGE 
[2026-05-02 14:01:49] [FINER] Visiting condition: CDEMO-PGM-REENTERANDCDEMO-FROM-PROGRAMNOTEQUALLIT-THISPGM 
[2026-05-02 14:01:49] [FINER] Visiting condition: CCARD-AID-PFK08ANDCA-NEXT-PAGE-EXISTS 
[2026-05-02 14:01:49] [FINER] Visiting condition: CCARD-AID-PFK07ANDNOTCA-FIRST-PAGE 
[2026-05-02 14:01:49] [FINER] Visiting condition: CCARD-AID-ENTERANDVIEW-REQUESTED-ON(I-SELECTED)ANDCDEMO-FROM-PROGRAMEQUALLIT-THISPGM 
java.lang.NullPointerException: Cannot invoke "org.smojol.common.vm.expression.RelationExpression.getRelationalOperation()" because the return value of "org.smojol.common.vm.expression.SimpleConditionExpression.getComparison()" is null
	at org.smojol.common.vm.expression.AdditionalConditionVisitor.getRelationalOperation(AdditionalConditionVisitor.java:50)
	at org.smojol.common.vm.expression.ConditionVisitor.visitCondition(ConditionVisitor.java:35)
	at org.smojol.common.vm.expression.ConditionVisitor.visitCondition(ConditionVisitor.java:6)
	at org.eclipse.lsp.cobol.core.CobolParser$ConditionContext.accept(CobolParser.java:42625)
	at org.smojol.common.vm.expression.CobolExpressionBuilder.condition(CobolExpressionBuilder.java:36)
	at org.smojol.common.vm.expression.EvaluateBreaker.condition(EvaluateBreaker.java:77)
	at org.smojol.common.vm.expression.EvaluateBreaker.mustHaveConditions(EvaluateBreaker.java:64)
	at org.smojol.common.vm.expression.EvaluateBreaker.recursiveOr(EvaluateBreaker.java:58)
	at org.smojol.common.vm.expression.EvaluateBreaker.conditionGroup(EvaluateBreaker.java:52)
	at java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:214)
	at java.base/java.util.ArrayList$ArrayListSpliterator.forEachRemaining(ArrayList.java:1716)
	at java.base/java.util.stream.AbstractPipeline.copyInto(AbstractPipeline.java:570)
	at java.base/java.util.stream.AbstractPipeline.wrapAndCopyInto(AbstractPipeline.java:560)
	at java.base/java.util.stream.AbstractPipeline.evaluate(AbstractPipeline.java:635)
	at java.base/java.util.stream.AbstractPipeline.evaluateToArrayNode(AbstractPipeline.java:291)
	at java.base/java.util.stream.ReferencePipeline.toArray(ReferencePipeline.java:652)
	at java.base/java.util.stream.ReferencePipeline.toArray(ReferencePipeline.java:658)
	at java.base/java.util.stream.ReferencePipeline.toList(ReferencePipeline.java:663)
	at org.smojol.common.vm.expression.EvaluateBreaker.decompose(EvaluateBreaker.java:41)
	at org.smojol.toolkit.ast.EvaluateFlowNode.buildInternalFlow(EvaluateFlowNode.java:44)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:48)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.PerformProcedureFlowNode.buildOutgoingFlow(PerformProcedureFlowNode.java:61)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at org.smojol.toolkit.ast.CompositeCobolFlowNode.buildInternalFlow(CompositeCobolFlowNode.java:53)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:48)
	at java.base/java.util.ArrayList.forEach(ArrayList.java:1604)
	at org.smojol.toolkit.ast.CobolFlowNode.buildOutgoingFlow(CobolFlowNode.java:54)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:49)
	at org.smojol.toolkit.ast.CompositeCobolFlowNode.buildInternalFlow(CompositeCobolFlowNode.java:53)
	at org.smojol.toolkit.ast.CobolFlowNode.buildFlow(CobolFlowNode.java:48)
	at org.smojol.toolkit.ast.BuildFlowNodesTask.buildFlowAST(BuildFlowNodesTask.java:16)
	at org.smojol.toolkit.ast.BuildFlowNodesTask.run(BuildFlowNodesTask.java:26)
	at org.smojol.toolkit.analysis.task.analysis.BuildBaseModelTask.run(BuildBaseModelTask.java:41)
	at org.smojol.toolkit.task.SmojolTasks$16.run(SmojolTasks.java:178)
	at java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:214)
	at java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:214)
	at java.base/java.util.AbstractList$RandomAccessSpliterator.forEachRemaining(AbstractList.java:722)
	at java.base/java.util.stream.AbstractPipeline.copyInto(AbstractPipeline.java:570)
	at java.base/java.util.stream.AbstractPipeline.wrapAndCopyInto(AbstractPipeline.java:560)
	at java.base/java.util.stream.AbstractPipeline.evaluate(AbstractPipeline.java:635)
	at java.base/java.util.stream.AbstractPipeline.evaluateToArrayNode(AbstractPipeline.java:291)
	at java.base/java.util.stream.ReferencePipeline.toArray(ReferencePipeline.java:652)
	at java.base/java.util.stream.ReferencePipeline.toArray(ReferencePipeline.java:658)
	at java.base/java.util.stream.ReferencePipeline.toList(ReferencePipeline.java:663)
	at org.smojol.toolkit.task.SmojolTasks.run(SmojolTasks.java:66)
	at org.smojol.toolkit.analysis.task.analysis.CodeTaskRunner.runForProgram(CodeTaskRunner.java:156)
	at org.smojol.toolkit.analysis.task.analysis.CodeTaskRunner.runForPrograms(CodeTaskRunner.java:95)
	at org.smojol.cli.MultiCommand.processPrograms(MultiCommand.java:105)
	at org.smojol.cli.MultiCommand.call(MultiCommand.java:92)
	at org.smojol.cli.MultiCommand.call(MultiCommand.java:30)
	at picocli.CommandLine.executeUserObject(CommandLine.java:2041)
	at picocli.CommandLine.access$1500(CommandLine.java:148)
	at picocli.CommandLine$RunLast.executeUserObjectOfLastSubcommandWithSameParent(CommandLine.java:2461)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:2453)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:2415)
	at picocli.CommandLine$AbstractParseResultHandler.execute(CommandLine.java:2273)
	at picocli.CommandLine$RunLast.execute(CommandLine.java:2417)
	at picocli.CommandLine.execute(CommandLine.java:2170)
	at org.smojol.cli.MultiCommandCLI.main(MultiCommandCLI.java:10)
[2026-05-02 14:01:49] [FINE] Runtime.exit() called with status: 1 
[JAR]  Using: C:\work\cobol-rekt\smojol-cli\target\smojol-cli.jar
[JAR]  Dialect: C:\work\cobol-rekt\che-che4z-lsp-for-cobol-integration\server\dialect-idms\target\dialect-idms.jar
[INFO] 1 source file(s) targeted

[REKT] COCRDLIC  (116 KB) ...
[FAIL] COCRDLIC: smojol-cli exited 1

--------------------------------------------------------
Program     Status
--------------------------------------------------------
COCRDLIC    FAIL      
--------------------------------------------------------
  ok=0  skipped=0  failed=1  timeout=0
--------------------------------------------------------

One or more programs failed. See output above.
After fixing, re-run:  py -3 validation/run_rekt_all.py --only <PROG>
